[
  {
    "name": "Aberdeen Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Aberdeen_Castle",
    "text": "Castle in Aberdeen, Scotland\nAberdeen Castle was a late Middle Ages fortification,[1] in Aberdeen, Scotland.[2] It was situated on Castle Hill, a site today known as the Castlegate, and the location of the castle is now occupied by blocks of flats.[3]\nBurned and demolished\nIt is thought the castle and fortifications were slighted[4] by King Robert the Bruce as was his policy on recaptured castles in June 1308, during the Wars of Scottish Independence immediately following the Harrying of Buchan. Bruce and his men laid siege to the castle before massacring the English Garrison to prevent its use by the English troops of Edward II. It is said the Scots showed no mercy but \"slew every man who fell into their hands. Edward I, indeed, had already set the example of executing his prisoners. It was not to be expected that the other side would fail to follow the same course\"[5] However, as of August 1308, Gilbert Pecche and the last troops were allowed to leave Aberdeen; this obviously cannot be accurate.[1] On 10 July 1308, English ships left Hartlepool to help the English garrison.[6] Legend tells that the city's motto, Bon Accord, came from the password used to initiate Bruce's final push and destruction of the castle.[7][8]\nSurrender to the English\nThe castle was surrendered to the English in 1295, and on 14 April 1296, the English King, Edward I arrived in Aberdeen and stayed in the castle as part of his suppression of the east coast of Scotland, having defeated the Scots.[9]\nWallace\nHowever, the following year, after defeating the English at Dunnottar Castle in 1297, William Wallace marched his men to Aberdeen during their campaign to retake the east coast for the Scots.\nThey found the English hastily preparing to leave in an armada of one hundred ships. The speed of Wallace's arrival from Dunottar caught the English unawares, and at low tide, the stranded ships were attacked in the harbour, the crew and soldiers slaughtered, the cargo taken, and the ships burnt.\nJohn Balliol\nThe English Sheriff of Aberdeen, Sir Henry de Lazom had been left in charge of the Castle, but during the chaos of the attack, he defected, declaring it in the name of the Scottish King, John Balliol.[10][11]\nReferences\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": null,
      "pre1291Found": false,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.14917",
      "lon": "-2.09028"
    }
  },
  {
    "name": "Banff Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Banff_Castle",
    "text": "Building in Banff, Scotland\nBanff Castle is a ruined former royal castle near Banff, Aberdeenshire, Scotland.[1]\nHistory\nBuilt as a motte and bailey castle in the 12th century and held by the Comyns, Earl of Buchan. The castle was visited by King Edward I of England in 1296 and also in 1298 after defeating William Wallace at the Battle of Falkirk during the Wars of Scottish Independence. The castle was garrisoned with English troops until being captured by the Scots in 1310. It came into the possession of the Sharps, before being sold to Lord Ogilvy of Deskford in 1722. The castle then passed into the hands of the Russells.\nThe old castle was demolished and a mansion house designed by architect John Adam was built in 1750. The remains of the old castle are a scheduled ancient monument.[2]\nCurrent house\nThe current house is a Category A listed building.[3] It serves as a community and arts venue for the town of Banff and the surrounding areas.\nReferences\nReferences This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Banff\". Encyclopædia Britannica (11th ed.). Cambridge University Press.\nExternal links\nOfficial website\n57°40′00″N 2°31′21″W / 57.6666°N 2.5224°W / 57.6666; -2.5224\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "12th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.6666",
      "lon": "-2.5224"
    }
  },
  {
    "name": "Coull Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Coull_Castle",
    "text": "Castle in Scotland\nCoull Castle was a 13th-century castle to the south of Coull, Aberdeenshire, Scotland.[1]\nHistory\nThe castle occupies an important and commanding position along the northern approach to Aboyne. Built by the Durwards in the 13th century and was the main stronghold of the barony of O’Neill. The last mention of the intact castle was in a charter dated 17 February 1554 from the Queen Regent, Mary I, which grants \"the lands of Cowle with their castle and mill, in the sheriffdom of Aberdeen.\" The castle was ruined by the first half of the 17th century according to the collections of Sir James Balfour.[2]\nThe castle ruins were excavated by the landowner Dr Marshall Mackenzie after his purchase of the land in 1912 and the excavations were later continued by W. Douglas Simpson in 1922.[2] The castle consisted of a pentagonal courtyard with at least three flanking towers. Slight traces of the castle are visible above ground.[1]\nReferences\n^ a b Coventry, Martin (2001). The Castles of Scotland. Musselburgh: Goblinshead. p. 175. ISBN 1-899874-26-7\n^ a b Simpson, W Douglas (10 December 1923). \"The Excavation of Coull Castle, Aberdeenshire\" (PDF). The Society of Antiquaries of Scotland. 58: 45–99 – via Archaeology Data Service.\nExternal links\nCoull Castle—Royal Commission on the Ancient and Historical Monuments of Scotland listing\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.1087",
      "lon": "-2.8063"
    }
  },
  {
    "name": "Delgatie Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Delgatie_Castle",
    "text": "Castle and museum in Aberdeenshire, Scotland, UK\nDelgatie Castle is a castle near Turriff, in Aberdeenshire, Scotland.\nA castle has stood on the site of Delgatie Castle since the year 1030 AD, although the earliest parts of the castle standing today were built between 1570 and 1579.[1] Additional wings and a chapel were added in 1743.\nThe castle was stripped from the disgraced Henry de Beaumont, Earl of Buchan, after the Battle of Bannockburn in 1314 and given to Clan Hay (later to become the Earls of Erroll). Mary, Queen of Scots, was a guest at the castle in 1562 after the Battle of Corrichie.[2]\nLike many castles, Delgatie is rumoured to be haunted. A number of reports of a ghostly red-haired figure, supposedly one Alexander Hay, were made by soldiers posted there during the Second World War. The castle's information boards, mostly written by Captain Hay who restored the house in the 1950s, recount that the ghost was first seen when a body was found bricked up in a priest hole.\nArchitecturally, the castle consists of a keep, adjoining house and two later wings. Notable features include a very wide turnpike stair and painted ceilings dating from the 16th century in two of the rooms, one dating from 1592, and the other from 1597.[3] In many places may be seen the Hay family arms including the three cattle yokes which recall a farmer and his two sons who were instrumental in the defeat of a Danish raiding party at Cruden Bay. (See Clan Hay for more detail.)\nToday, the castle and its gardens are owned by the Delgatie Castle Trust. The castle, grounds and café are open to the public throughout the summer months and suites within the castle itself and a number of cottages on the estate are available to rent. There is also a popular fishing site on the river passing through.\nGallery Delgatie Castle in 2017 Painted ceiling in Delgatie Castle\nExternal links\nWikimedia Commons has media related to Delgatie Castle.\nDelgatie Castle website\nReferences\n57°32′39″N 2°24′43″W / 57.5443°N 2.4120°W / 57.5443; -2.4120\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1030,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.5443",
      "lon": "-2.4120"
    }
  },
  {
    "name": "Drum Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Drum_Castle",
    "text": "Tower house in Aberdeenshire, Scotland\nDrum Castle is a castle near Drumoak in Aberdeenshire, Scotland. For centuries it was the seat of the chief of Clan Irvine.[1] The place-name Drum is derived from Gaelic druim, 'ridge'.[2] The site is located approximately 6+1⁄2 miles (10.5 kilometres) northeast of Banchory and 3 miles (5 kilometres) west of Peterculter. The property is now owned by the National Trust for Scotland and is open to the public.\nHistory\nThe original 13th-century tower of Drum Castle has been suggested as the work of medieval architect Richard Cementarius, who built the Brig o' Balgownie, the first Bridge of Don, in Old Aberdeen. It is believed to be one of the three oldest tower houses in Scotland (and notably unaltered). A large wing was added in 1619 by the 9th laird, and further alterations were made during the Victorian era.\nThe castle and its grounds were granted to William de Irwyn in 1323 by Robert the Bruce, and remained in the possession of Clan Irvine until 1975. William de Irwyn (of the Irvings of Bonshaw clan) was armour bearer/secretary (and neighbour) to King Robert the Bruce. In June 1636 Sir Sir Alexander Irvine of Drum and his wife Magdalene Scrimgeour were censured for harbouring the outlaw Gilderoy.[3] Drum played a role in the Covenanting Rebellion (as did nearby Muchalls Castle) leading to its being attacked and sacked three times.\nThe castle in 1829 (by John Preston Neale)\nIn the 19th century, it was the home of Alexander Forbes Irvine of Drum FRSE (1818–1892).[4] He had inherited the estate in 1861, on the death of his father. In 1875/1876, he arranged for a restoration of the courtyard, and the addition of an arched entrance and angle tower.[5][6] He was also partly responsible for a restoration of the chapel.[7]\nThere was an older church located here; it was modified to create the chapel in the 1500s and 1600s. In 1857, the west window was enlarged and the cross was added; a new roof was also installed and some restoration of the interior was completed.[8][9]\nThe site was once served by Drum railway station on the Deeside Railway. Service was discontinued in 1951.\nRecent status\nThe castle has been a Category-A Listed property since 1987. The report states that the agreement with the National Trust was made in 1964 by Mr H.Q. Forbes Irvine, the 24th Laird, and that the agreement came into force in 1976, after 650 years of ownership by the Irvine Lairds. The summary states that the tower was built in 1280–1300, that the Jacobean Wing was added in 1619 and that modifications were made ca. 1800, 1840 and 1875. The Chapel is Category-B Listed as are the Walled Garden and East Lodge; in 1987, the garden was \"derelict\".[10]\nThe chapel, dining hall and estate may be hired for weddings and corporate functions. The current (early 2020) NTS website, however, discusses its Garden of Historic Roses, spread out over four distinct areas. The grand Victorian library with over 4,000 books was one of the attractions; the castle was also offering a \"programme of temporary exhibitions throughout the year\".[11][12] A tourism website added that the castle \"contains superb furniture and paintings. In the 16th-century chapel are a beautiful stained glass window and the Augsburg silver Madonna\". The site has a playground, a small shop and a tearoom.[13]\nThe castle, gardens and estate are open to visitors throughout the year.[14] During 2019, 47,446 people visited the castle.[15]\nArea's ancient history\nPrehistoric habitation of the local area is known through archaeological sites such as Balbridie. Roman legions marched from Raedykes to nearby Normandykes as they sought higher ground evading the bogs of Red Moss and other low-lying mosses associated with the Burn of Muchalls. That march used the Elsick Mounth, one of the ancient trackways crossing the Grampian Mountains; the situation of the Elsick Mounth terminating at a ford to the River Dee is thought to have been instrumental in the strategic siting of Drum Castle as a point to monitor traffic on the Elsick Mounth[16] lying west of Netherley.\nGallery The Rose Garden at Drum Castle Walled Garden, Drum Castle Gateway of the Walled Garden at Drum Castle North-East corner of the Walled Garden at Drum Castle Southern boundary of the Walled Garden at Drum Castle Drum Castle Chapel Drum Castle chapel Interior & Altar\nReferences\nExternal links\nDrum Castle at National Trust of Scotland\nSummer Snow - Cottonwood tree at Drum Castle\nViews of Drum Castle and chapel\n360 Virtual Tour of Drum Castle Grounds\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1280,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.09503",
      "lon": "-2.33794"
    }
  },
  {
    "name": "Dundarg Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Dundarg_Castle",
    "text": "Ruined castle in Scotland\nRemains of Dundarg Castle, and the modern house on the site, overlooking Aberdour Bay\nDundarg Castle is a ruined castle about 2 kilometres (1.2 mi) north-northeast of New Aberdour, Aberdeenshire, Scotland, built within the ramparts of an earlier Iron Age promontory fort.[1] It was described by W. Douglas Simpson as one of the nine castles of the Knuckle, referring to the rocky headland of North-East Aberdeenshire,[2] and by Charles McKean as \"Scotland's answer to Tintagel\".[3] It became a small Celtic monastery for a period.[4]\nStructure\nThe site consists of a triangle of gently sloping ground flanked by steep slopes on all sides, linked to a flat-topped elongated promontory extending to the north-east, surrounded by 20 metres (66 ft) high sandstone cliffs.[5] Its name comes from the Gaelic dun dearg, meaning red fort or castle, referring to the colour of the sandstone.[5]\nHistory\nThe 10th-century Book of Deer records the existence of a cathair or fortified place at Aberdour.[5]\nIt was built in the 13th century by the Comyn family, but was dismantled, probably by Robert the Bruce, in 1308. It was rebuilt in 1334 by Henry de Beaumont, but slighted almost immediately, after a famous siege by Sir Andrew Moray. Many medieval objects providing evidence of this double destruction were found in excavations in 1911-12 and 1950-51, led by W. Douglas Simpson.\nThe only substantial part of the castle remaining is the inner gatehouse, which survives to a height of about 18 feet (5.5 m). The upper part was rebuilt in the middle of the 16th century, probably following the Coastal Defence Commission of 1550, and there is some evidence that it was provided with gunloops at that time. The site was finally abandoned in the mid-17th century. A house was built on part of the site in 1938, reputedly by and for Wing Commander David Vaughan Carnegie, using stone from the former Aberdour Free Church.[6][7]\nThe castle and promontory fort are protected as a scheduled monument,[8] while the modern house is a category B listed building.[7]\nReferences\nBibliography\nBeveridge, W. (1912). \"Excavations at Dundargue Castle\" (PDF). Proceedings of the Society of Antiquaries of Scotland. 48: 184–91. Retrieved 15 October 2008.\nFojut, N.; Love, P. (1983). \"The defences of Dundarg Castle, Aberdeenshire\" (PDF). Proceedings of the Society of Antiquaries of Scotland. 113: 449–56. Retrieved 10 October 2015.\nRees, S.E. (1983). \"A wooden ard-share from Dundarg, Aberdeenshire, with a note on other wooden plough pieces\" (PDF). Proceedings of the Society of Antiquaries of Scotland. 113: 457–63. Retrieved 15 October 2008.\n\"Dundarg Castle\". Canmore. Historic Environment Scotland. Retrieved 10 October 2015.\nSimpson, W. D. (1954) Dundarg Castle. Aberdeen University.\nSimpson, W. D. (1960) 'Dundarg Castle reconsidered', Transactions of the Buchan Field Club 17(4), pp. 9–25.\n57°40′26.59″N 2°10′39.03″W / 57.6740528°N 2.1775083°W / 57.6740528; -2.1775083\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.6740528",
      "lon": "-2.1775083"
    }
  },
  {
    "name": "Dunnideer Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Dunnideer_Castle",
    "text": "Ruined tower house in Insch, Aberdeenshire, Scotland\nDunnideer Castle in February 2024.\nDunnideer Castle, now ruined, was a tower house located near Insch, Aberdeenshire, Scotland. It was built c. 1260 partially from the remains of an existing vitrified hill fort in the same location. It consisted of a single rectangular tower of 15 m by 12.5 m with walls 1.9 m thick. Evidence suggests that a first-floor hall existed and that it had several floors.[1]\nThe tower house is built within an older prehistoric vitrified hillfort dating to c250 BC, excavated by Dr Murray Cook of Rampart Scotland.[2]\nThe prehistoric fort and tower house is a scheduled monument.[3]\nReferences\n57°20′32″N 2°38′46″W / 57.34222°N 2.64611°W / 57.34222; -2.64611\nExternal links\nTake a 360 Virtual Tour of Dunnideer Castle\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1260,
      "pre1291Found": true,
      "post1291Found": false
    },
    "coordinates": {
      "lat": "57.34222",
      "lon": "-2.64611"
    }
  },
  {
    "name": "Dunnottar Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Dunnottar_Castle",
    "text": "Ruined castle in Scotland\nFor ships of this name, see RMS Dunottar Castle and MS Dunnottar Castle.\n\"Dunnottar\" redirects here. For other uses, see Dunnottar (disambiguation).\nDunnottar Castle (Scottish Gaelic: Dùn Fhoithear, \"fort on the shelving slope\")[1] is a ruined medieval fortress located upon a rocky headland on the northeast coast of Scotland, about 2 miles (3 kilometres) south of Stonehaven in Aberdeenshire. The surviving buildings are largely of the 15th and 16th centuries, but the site is believed to have been fortified in the Early Middle Ages. Dunnottar has played a prominent role in the history of Scotland through to the 18th-century Jacobite risings because of its strategic location and defensive strength.\nDunnottar is best known as the place where the Honours of Scotland, the Scottish crown jewels, were hidden from Oliver Cromwell's invading army in the 17th century. The property of the Keiths from the 14th century, and the seat of the Earl Marischal, Dunnottar declined after the last Earl forfeited his titles by taking part in the Jacobite rebellion of 1715. The castle was restored in the 20th century and is now open to the public.\nThe ruins of the castle are spread over 1.4 hectares (3+1⁄2 acres), surrounded by steep cliffs that drop to the North Sea, 160 feet (50 metres) below. A narrow strip of land joins the headland to the mainland, along which a steep path leads up to the gatehouse. The various buildings within the castle include the 14th-century tower house as well as the 16th-century palace. Dunnottar Castle is a scheduled monument,[2] and twelve structures on the site were listed buildings.[3]\nHistory\nEarly Middle Ages\nThis historic view of Dunnottar Castle by the Dutch engineer John Slezer is now recognised as an incorrect labelling by his engraver. It is actually Wemyss Castle in Fife\nA chapel at Dunnottar is said to have been founded by St Ninian in the 5th century,[4] although it is not clear when the site was first fortified, but in any case the legend is late and highly implausible. Possibly the earliest written reference to the site is found in the Annals of Ulster which record two sieges of 'Dún Foither' in 681 and 694. The earlier event has been interpreted as an attack by Brude, the Pictish king of Fortriu, to extend his power over the north-east coast of Scotland.[5] The Chronicle of the Kings of Alba records that King Donald II of Scotland, the first ruler to be called rí Alban (King of Alba), was killed at Dunnottar during an attack by Vikings in 900.[6] The English king Æthelstan led a force into Scotland in 934, and raided as far north as Dunnottar according to the account of Symeon of Durham.[7]\nW. D. Simpson speculated that a motte might lie under the present castle, but excavations in the 1980s failed to uncover substantive evidence of early medieval fortification. The discovery of a group of Pictish stones at Dunnicaer, a nearby sea stack, has prompted speculation that Dún Foither was actually located on the adjacent headland of Bowduns, 3 miles (5 km) to the north.[8]\nLater Middle Ages\nDuring the reign of King William the Lion (ruled 1165–1214), Dunnottar was a centre of local administration for The Mearns.[9] The castle is named in the Roman de Fergus, an early 13th-century Arthurian romance, in which the hero Fergus must travel to Dunnottar to retrieve a magic shield.[10][11] In May 1276, a church on the site was consecrated by William Wishart, Bishop of St Andrews.[10] The poet Blind Harry relates that William Wallace captured Dunnottar from the English in 1297, during the Wars of Scottish Independence. He is said to have imprisoned 4,000 English prisoners of war in the church and burned them alive.[4]\nIn 1336, Edward III of England ordered William Sinclair, 8th Baron of Roslin, to sail eight ships to the partially ruined Dunnottar for the purpose of rebuilding and fortifying the site as a forward resupply base for his northern campaign. Sinclair took with him 160 soldiers, horses, and a corps of masons and carpenters.[12] Edward himself visited in July,[13] but the English efforts were undone before the end of the year when the Scottish Regent Sir Andrew Murray led a force that captured and again destroyed the defences of Dunnottar.[4]\nIn the 14th century, Dunnottar was granted to William de Moravia, 5th Earl of Sutherland (d.1370);[14] in 1346, a licence to crenellate was issued by David II.[15][16] Around 1359, William Keith, Marischal of Scotland, married Margaret Fraser, niece of Robert the Bruce, and was granted the barony of Dunnottar at this time. Keith then gave the lands of Dunnottar to his daughter Christian and son-in-law William Lindsay of Byres, but in 1392 an excambion (exchange) was agreed whereby Keith regained Dunnottar and Lindsay took lands in Fife.[14][17] William Keith completed construction of the tower house at Dunnottar, but was excommunicated for building on the consecrated ground associated with the parish church. Keith had provided a new parish church closer to Stonehaven, but was forced to write to the Pope, Benedict XIII, who issued a bull in 1395 lifting the excommunication.[14] William Keith's descendants were made Earls Marischal in the mid 15th century, and they held Dunottar until the 18th century.[4]\n16th-century rebuilding\nGeorge Keith, 5th Earl Marischal, painted by Cosmo Alexander\nJames IV came to Dunnottar on 15 October 1504. A child played a musical instrument called a monochord for him, and he gave money to poor people. The king had brought his Italian minstrels and an African drummer, known as the \"More taubronar\".[18]\nThrough the 16th century, the Keiths improved and expanded their principal seats: at Dunnottar and also at Keith Marischal in East Lothian. James IV visited Dunnottar in 1504, and in 1531 James V exempted the Earl's men from military service on the grounds that Dunnottar was one of the \"principall strenthis of our realme\".[19] Mary, Queen of Scots, visited in 1562 after the Battle of Corrichie,[20][21] and returned in 1564.[4] James VI stayed for 10 days in 1580, as part of his progress through Fife and Angus,[22] during which a meeting of the Privy Council was convened at Dunnottar.[23] King James came again on 17 April 1589 and spent the night at Cowie watching for the Catholic rebel earls of Huntly and Erroll.[24] During the rebellion of Catholic nobles in 1592, Dunnottar was captured by Captain Carr on behalf of the Earl of Huntly, but was restored to Lord Marischal just a few weeks later.[25]\nIn 1581, George Keith succeeded as 5th Earl Marischal, and began a large-scale reconstruction that saw the medieval fortress converted into a more comfortable home. As the founder of Marischal College in Aberdeen, the 5th Earl valued Dunnottar as much for its dramatic situation as for its security.[26] A \"palace\" comprising a series of ranges around a quadrangle was built on the north-eastern cliffs, creating luxurious living quarters with sea views. The 13th-century chapel was restored and incorporated into the quadrangle.[15] An impressive stone gatehouse was constructed, now known as Benholm's Lodging, featuring numerous gun ports facing the approach. Although impressive, these are likely to have been fashionable embellishments rather than genuine defensive features.[27] The earl had a suite of 'Samson' tapestries which may have represented his religious outlook.[28]\nCivil wars\nFurther information: Scotland in the Wars of the Three Kingdoms\nWilliam Keith, 7th Earl Marischal, painted by George Jamesone in 1636\nIn 1639, William Keith, 7th Earl Marischal, came out in support of the Covenanters, a Presbyterian movement who opposed the established Episcopal Church and the changes which Charles I was attempting to impose. With James Graham, 1st Marquess of Montrose, he marched against the Catholic James Gordon, 2nd Viscount Aboyne, Earl of Huntly, and defeated an attempt by the Royalists to seize Stonehaven. However, when Montrose changed sides to the Royalists and marched north, Marischal remained in Dunnottar, even when given command of the area by Parliament, and even when Montrose burned Stonehaven.[29]\nMarischal then joined with the Engager faction, who had made a deal with the king, and led a troop of horse to the Battle of Preston (1648) in support of the royalists.[29] Following the execution of Charles I in 1649, the Engagers gave their allegiance to his son and heir. Charles II was proclaimed king, arriving in Scotland in June 1650. He visited Dunnottar in July 1650,[29] but his presence in Scotland prompted Oliver Cromwell to lead a force into Scotland, defeating the Scots at Dunbar in September 1650.[30]\nHonours of Scotland\nCharles II was crowned at Scone Palace on 1 January 1651, at which the Honours of Scotland (the regalia of crown, sword and sceptre) were used. However, with Cromwell's troops in Lothian, the honours could not be returned to Edinburgh. The Earl Marischal, as Marischal of Scotland, had formal responsibility for the honours,[29] and in June the Privy Council duly decided to place them at Dunnottar.[17] They were brought to the castle by Katherine Drummond, hidden in sacks of wool.[31] Sir George Ogilvie (or Ogilvy) of Barras was appointed lieutenant-governor of the castle, and given responsibility for its defence.[32]\nIn November 1651, Cromwell's troops called on Ogilvie to surrender, but he refused. During the subsequent blockade of the castle, the removal of the Honours of Scotland was planned by Elizabeth Douglas, wife of Sir George Ogilvie, and Christian Fletcher, wife of James Granger, minister of Kinneff Parish Church. The king's papers were first removed from the castle by Anne Lindsay, a kinswoman of Elizabeth Douglas, who walked through the besieging force with the papers sewn into her clothes.[31] Two stories exist regarding the removal of the honours themselves. Fletcher stated in 1664 that over the course of three visits to the castle in February and March 1652, she carried away the crown, sceptre, sword and sword case hidden amongst sacks of goods. Another account, given in the 18th century by a tutor to the Earl Marischal, records that the honours were lowered from the castle onto the beach, where they were collected by Fletcher's servant and carried off in a creel (basket) of seaweed. Having smuggled the honours from the castle, Fletcher and her husband buried them under the floor of the Old Kirk at Kinneff.[31]\nBy May 1652 the commander of the blockade, Colonel Thomas Morgan, had taken delivery of the artillery necessary for the reduction of Dunnottar.[32] Ogilvie surrendered on 24 May, on condition that the garrison could go free. Finding the honours gone, the Cromwellians imprisoned Ogilvie and his wife in the castle until the following year, when a false story was put about suggesting that the honours had been taken overseas.[32] Much of the castle property was removed, including twenty-one brass cannons,[33] and Marischal was required to sell further lands and possessions to pay fines imposed by Cromwell's government.[29]\nAt the Restoration of Charles II in 1660, the honours were removed from Kinneff Church and returned to the king. Ogilvie quarrelled with Marischal's mother over who would take credit for saving the honours,[29] though he was eventually rewarded with a baronetcy. Fletcher was awarded 2,000 merks by Parliament but the sum was never paid.[31]\nWhigs and Jacobites\nDunnottar drawn by John Slezer in 1693\nReligious and political conflicts continued to be played out at Dunnottar through the 17th and early 18th centuries. In 1685, during the rebellion of the Earl of Argyll against the new king James VII, 167 Covenanters were seized and held in a cellar at Dunnottar. The prisoners included 122 men and 45 women associated with the Whigs, an anti-Royalist group within the Covenanter movement, and had refused to take an oath of allegiance to the new king.[34] The Whigs were imprisoned from May 24 until late July. A group of 25 escaped, although two of these were killed in a fall from the cliffs, and another 15 were recaptured.[35] Five prisoners died in the vault, and 37 of the Whigs were released after taking the oath of allegiance.[34] The remaining prisoners were transported to Perth Amboy, New Jersey, as part of a colonisation scheme devised by George Scot of Pitlochie. Many, like Scot himself, died on the voyage.[36] The cellar, located beneath the \"King's Bedroom\" in the 16th-century castle buildings, has since become known as the \"Whigs' Vault\".[34]\nBoth the Jacobites (supporters of the exiled Stuarts) and the Hanoverians (supporters of George I and his descendants) used Dunnottar Castle. In 1689, during Viscount Dundee's campaign in support of the deposed James VII, the castle was garrisoned for William III and Mary II with Lord Marischal appointed captain.[37] Seventeen suspected Jacobites from Aberdeen were seized and held in the fortress for around three weeks, including George Liddell, professor of mathematics at Marischal College.[38] In the Jacobite Rising of 1715 George Keith, 10th Earl Marischal, took an active role with the rebels, leading cavalry at the Battle of Sheriffmuir. After the subsequent abandonment of the rising Lord Marischal fled to the Continent, eventually becoming French ambassador for Frederick the Great of Prussia. Meanwhile, in 1716, his titles and estates including Dunnottar were declared forfeit to the crown.[39]\nLater history\nDunnottar Castle by James Cassie, 1857\nDunnottar Castle by Waller Hugh Paton, 1867\nThe seized estates of the Earl Marischal were purchased in 1720 for £41,172, by the York Buildings Company who dismantled much of the castle.[17] In 1761, the Earl briefly returned to Scotland and bought back Dunnottar only to sell it five years later to Alexander Keith (1736–1819),[40] an Edinburgh lawyer who served as Knight Marischal of Scotland.[17] Dunnottar was held by Alexander Keith and then his son, Sir Alexander Keith (1768–1832) before being inherited in 1852 by Sir Patrick Keith-Murray of Ochtertyre, who in turn sold it in July 1873 to Major Alexander Innes of Cowie and Raemoir for about £80,000.[41] It was purchased by Weetman Pearson, 1st Viscount Cowdray, in 1925, after which his wife embarked on a programme of repairs.[34] Since that time, the castle has remained in the family, and has been open to the public, attracting 52,500 visitors in 2009,[42] and over 135,000 visitors in 2019.[43]\nDunnottar Castle, and the headland on which is stands, was designated as a Scheduled monument in 1970.[2]\nIn 1972, twelve of the structures at Dunnottar were listed.[3] Three buildings were listed at category A as being of \"national importance\": the keep;[44] the entrance gateway;[45] and Benholm's Lodging.[46] The remaining listings were at category B as being of \"regional importance\".[47] However, in 2018, the listed status for those buildings was removed as part of Historic Environment Scotland's \"Dual Designation 2A Project\".[44][45][48][46][49][50][51][52][53][54][55][56]\nThe Hon. Charles Anthony Pearson, the younger son of the 3rd Viscount Cowdray, currently owns and runs Dunnottar Castle which is part of the 210-square-kilometre (81 sq mi) Dunecht Estates.[57] Portions of the 1990 film Hamlet, starring Mel Gibson and Glenn Close, were shot there.[58] In the Disney movie Brave, Dunnottar Castle was chosen for Merida's home.\nDescription\nPlan of Dunnottar Castle Key: A Gatehouse and Benholm's Lodging · B Tunnels · C Tower house · D Forge · E Waterton's Lodging · F Stables · G Palace · H Chapel · I Postern gate · J Whigs' Vault · K Bowling green · L Sentry box · M Cliffs · N North Sea\nDunnottar's strategic location allowed its owners to control the coastal terrace between the North Sea cliffs and the hills of the Mounth, 2+1⁄4 miles (3.6 km) inland, which enabled access to and from the north-east of Scotland.[59] The site is accessed via a steep, 2,600-foot (790 m) footpath (with modern staircases) from a car park on the coastal road, or via a 3-kilometre (2 mi) cliff-top path from Stonehaven.\nDunnottar's several buildings, put up between the 13th and 17th centuries, are arranged across a headland covering around 1.4 hectares (3+1⁄2 acres).[9] The dominant building, viewed from the land approach, is the 14th-century keep or tower house. The other principal buildings are the gatehouse; the chapel; and the 16th-century \"palace\" which incorporates the \"Whigs' Vault\".\nDefences\nThe gatehouse (centre) and Benholm's Lodging (left) seen from within the castle\nThe approach to the castle is overlooked by outworks on the \"Fiddle Head\", a promontory on the western side of the headland. The entrance is through the well-defended main gate, set in a curtain wall which entirely blocks a cleft in the rocky cliffs.[60] The gate has a portcullis and has been partly blocked up. Alongside the main gate is the 16th-century Benholm's Lodging, a five-storey building cut into the rock, which incorporated a prison with apartments above.[15] Three tiers of gun ports face outwards from the lower floors of Benholm's Lodging, while inside the main gate, a group of four gun ports face the entrance. The entrance passage then turns sharply to the left, running underground through two tunnels to emerge near the tower house.[9]\nSimpson contends that these defences are \"without exception the strongest in Scotland\",[61] although later writers have doubted the effectiveness of the gun ports. Cruden notes that the alignment of the gun ports in Benholm's Lodging, facing across the approach rather than along, means that they are of limited efficiency.[62] The practicality of the gun ports facing the entrance has also been questioned,[15] though an inventory of 1612 records that four brass cannons were placed here.[63]\nA second access to the castle leads up from a rocky cove, the aperture to a marine cave on the northern side of the Dunnottar cliffs into which a small boat could be brought. From here a steep path leads to the well-fortified postern gate on the cliff-top, which in turn offers access to the castle via the Water Gate in the palace. Artillery defences, taking the form of earthworks, surround the north-west corner of the castle, facing inland, and the south-east, facing seaward.[33] A small sentry box or guard house stands by the eastern battery, overlooking the coast.[64]\nTower house and surrounding buildings\nThe tower house of Dunnottar, viewed from the west\nThe late 14th-century tower house has a stone-vaulted basement, and originally had three further storeys and a garret above.[4] Measuring 40 by 36 feet (12 by 11 m), the tower house stood 50 feet (15 m) high to its gable.[65] The principal rooms included a great hall and a private chamber for the lord, with bedrooms upstairs.[15] Beside the tower house is a storehouse, and a blacksmith's forge with a large chimney. A stable block is ranged along the southern edge of the headland. Nearby is Waterton's Lodging, also known as the Priest's House, built around 1574,[66] possibly for the use of William Keith (died 1580), son of the 4th Earl Marischal.[15] This small self-contained house includes a hall and kitchen at ground level, with private chambers above, and has a projecting spiral stair on the north side.[66] It is named for Thomas Forbes of Waterton, an attendant of the 7th Earl.[67]\nPalace\nThe palace, from the south-west, with the Silver House in the foreground, and the chapel on the right\nThe palace, to the north-east of the headland, was built in the late 16th century and early to mid-17th century. It comprises three main wings set out around a quadrangle, and for the most part is probably the work of the 5th Earl Marischal who succeeded in 1581.[nb 1] It provided extensive and comfortable accommodation to replace the rooms in the tower house. In its long, low design it has been compared to contemporary English buildings, in contrast to the Scottish tradition of taller towers still prevalent in the 16th century.[68]\nSeven identical lodgings are arranged along the west range, each opening onto the quadrangle and including windows and fireplaces. Above the lodgings of the west range comprised a 120-foot (37 m) gallery. Now roofless, the gallery originally had an elaborate oak ceiling, and on display was a Roman tablet taken from the Antonine Wall.[69][nb 2] At the north end of the gallery was a drawing room linked to the north range. The gallery could also be accessed from the Silver House to the south, which incorporated a broad stairway with a treasury above.[15]\nDunnottar castle viewed from above the entry path\nThe basement of the north range incorporates kitchens and stores, with a dining room and great chamber above. At ground floor level is the Water Gate, between the north and west ranges, which gives access to the postern on the northern cliffs.[70] The east and north ranges are linked via a rectangular stair. The east range has a larder, brewhouse and bakery at ground level, with a suite of apartments for the countess above. A north-east wing contains the Earl's apartments, and includes the \"King's Bedroom\" in which Charles II stayed. In this room is a carved stone inscribed with the arms of the 7th Earl and his wife, and the date 1645. Below these rooms is the Whigs' Vault, a cellar measuring 52 by 15 ft (15.8 by 4.6 m). This cellar, in which the Covenanters were held in 1685, has a large eastern window, as well as a lower vault accessed via a trapdoor in the floor.[71] Of the chambers in the palace, only the dining room and the Silver House remain roofed, having been restored in the 1920s.\nThe central area contains a circular cistern or fish pond, 50 ft (15 m) across and 25 ft (7.6 m) deep,[72] and a bowling green is located to the west.[4] At the south-east corner of the quadrangle is the chapel, consecrated in 1276 and largely rebuilt in the 16th century. Medieval walling and two 13th-century windows remain, and there is a graveyard to the south.[9][15] Dunnottar Castle\nSee also\nDunnottar Parish Church\nNotes\nReferences\nBibliography\nAlcock, Leslie; Alcock, Elizabeth A (1992). \"Reconnaissance excavations on Early Historic fortifications and other royal sites in Scotland, 1974–84; 5: A, Excavations & other fieldwork at Forteviot, Perthshire, 1981; B, Excavations at Urquhart Castle, Inverness-shire, 1983; C, Excavations at Dunnottar, Kincardineshire, 1984\" (PDF). Proceedings of the Society of Antiquaries of Scotland. 122: 215–287.\nAnderson, Alan Orr (1990). Early Sources of Scottish History A.D 500–1286. Vol. 1. Stamford: Paul Watkins. ISBN 1-871615-03-8.\nBaigent, Elizabeth (2004). \"Fletcher, Christian, Lady Abercrombie (1619/20–1691)\". Oxford Dictionary of National Biography. Oxford University Press. doi:10.1093/ref:odnb/98528. (subscription or UK public library membership required)\nCoventry, Martin (2006). The Castles of Scotland (4th ed.). Birlinn. ISBN 1841584495.\nCruden, Stewart (1981). The Scottish Castle (3rd ed.). Spurbooks. ISBN 0-7157-2088-0.\nFoot, Sarah (2004). \"Æthelstan (Athelstan) (893/4–939), king of England\". Oxford Dictionary of National Biography. Oxford University Press. doi:10.1093/ref:odnb/833. (subscription or UK public library membership required)\nGeddes, Jane (2001). Deeside and the Mearns: An Illustrated Architectural Guide. Edinburgh: Rutland Press. ISBN 1-873-190-409.\nGoodare, Julian; Lynch, Michael (2000). \"James VI: Universal King?\". In Goodare, Julian; Lynch, Michael (eds.). The Reign of James VI. East Linton: Tuckwell. ISBN 1-86232-095-0.\nGroome, Francis H (1885). Ordnance Gazetteer of Scotland: A Survey of Scottish Topography, Statistical, Biographical and Historical. Vol. II. Edinburgh: Thomas C. Jack.\nFurgol, Edward M. (2004). \"Keith, George, styled tenth Earl Marischal (1692/3?–1778)\". Oxford Dictionary of National Biography. Oxford University Press. doi:10.1093/ref:odnb/15265. (subscription or UK public library membership required)\nHandley, Stuart (2004). \"Scot, George, of Scotstarvit (died 1685)\". Oxford Dictionary of National Biography. Oxford University Press. doi:10.1093/ref:odnb/24868. (subscription or UK public library membership required)\nHenderson, T. F.; Furgol, Edward M. (2004). \"Ogilvie, Sir George, of Barras, first baronet (fl. 1634–1679)\". In Furgol, Edward M (ed.). Oxford Dictionary of National Biography. Oxford University Press. doi:10.1093/ref:odnb/20594. (subscription or UK public library membership required)\nHoward, Deborah (1995). Scottish Architecture from the Reformation to the Restoration, 1560–1660. The Architectural History of Scotland. Edinburgh University Press. ISBN 978-0-7486-0530-9.\nJervise, Andrew (1875). Epitaphs & inscriptions from burial grounds & old buildings in the north-east of Scotland, with historical, biographical, genealogical, and antiquarian notes, also, an appendix of illustrative papers. Edinburgh: Edmonston and Douglas.\nMacGibbon, David; Ross, Thomas (1887). The Castellated and Domestic Architecture of Scotland. Vol. I. Edinburgh: David Douglas.\nMartinolli, Marina; Bereziat, Claire. The 2009 Visitor Attraction Monitor (PDF). Moffat Centre for Travel and Tourism Business Development. VisitScotland. ISBN 9781905866496. Archived from the original (PDF) on 21 April 2014.\nMcGladdery, C. A. (2004). \"Keith family (per. c.1300–c.1530)\". Oxford Dictionary of National Biography. Oxford University Press. doi:10.1093/ref:odnb/54235. (subscription or UK public library membership required)\nMcKean, Charles (2004). The Scottish Chateau (2nd ed.). Stroud: Sutton Publishing. ISBN 0-7509-3527-8.\nStevenson, David (2004). \"Keith, William, sixth Earl Marischal (1614–1671)\". Oxford Dictionary of National Biography. Oxford University Press. doi:10.1093/ref:odnb/15278. (subscription or UK public library membership required)\nSimpson, William Douglas (1966). Dunnottar Castle: Historical and Descriptive (10th ed.). Aberdeen: Wyllie's.\nSumption, Jonathan (1991). The Hundred Years War. University of Pennsylvania Press. ISBN 9780812231472.\nTabraham, Chris (1997). Scotland's Castles. BT Batsford/Historic Scotland. ISBN 0-7134-7965-5.\nWatson, Morag; Macleod, Michelle, eds. (2010). The Edinburgh Companion to the Gaelic Language. Edinburgh: Edinburgh University Press. ISBN 978-0-7486-3709-6.\nWenthe, Michael (2012). \"Mapping Scottish Identity in the Roman de Fergus\" (PDF). LATCH: A Journal for the Study of the Literary Artifact in Theory, Culture, or History. 5: 28–53. ISSN 1940-5731.\nExternal links\nWikimedia Commons has media related to Dunnottar Castle.\nDunnottar Castle homepage\nDunecht Estates homepage\nGhosts, History, Photographs and Paintings of Dunnottar Castle from Aboutaberdeen.com\nEngraving of Dunottar in 1693 by John Slezer at National Library of Scotland\nDunnotter Castle Virtual Tour Archived 28 October 2021 at the Wayback Machine\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1165,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.946",
      "lon": "-2.197"
    }
  },
  {
    "name": "Findlater Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Findlater_Castle",
    "text": "Castle on the coast of Banff and Buchan, Aberdeenshire, Scotland\nFindlater Castle.\nclass=notpageimage| Findlater Castle shown within the United Kingdom(grid reference NJ541672)\nFindlater Castle is the old seat of the Earls of Findlater and Seafield, sitting on a 50-foot (15 m)-high cliff overlooking the Moray Firth on the coast of Banff and Buchan, Aberdeenshire, Scotland.\nLocation and etymology\nIt lies about 15 km (9.3 mi) west of Banff, near the village of Sandend, between Cullen and Portsoy. The cliffs here contain quartz; the name \"Findlater\" is derived from the Scots Gaelic words fionn (\"white\") and leitir (\"cliff or steep slope\").\nHistory\nThe first historical reference to the castle is from 1246. King Alexander III of Scotland repaired this castle in the 1260s in preparation for an invasion by King Haakon IV of Norway. The Norwegians took and held the castle for some time. The castle remains that are still there are from the 14th-century rebuilding, when the castle was redesigned based on the Roslyn Castle model.\nJames V of Scotland visited Findlater in November 1535 after a pilgrimage to Tain.[1] The Laird of Findlater, an Ogilvy, was Master of Household to Mary of Guise. He lost his inheritance following sexual misconduct with his mother-in-law and making a plan to imprison his father in a cellar to deprive him of sleep and drive him insane to obtain his lands. After his father's death his mother married John Gordon, a son of the Earl of Huntly, who then took possession of the castle and lands, and promptly imprisoned her.[2]\nJohn Gordon, now of Findlater, fought with Lord Ogilvy in July 1562 and injured his arm.[3] Gordon was imprisoned in Edinburgh until his victim healed, according to custom.[4] In September 1562 Mary, Queen of Scots sent an army equipped with artillery from Dunbar Castle to besiege Findlater, and eject John Gordon of Findlater.[5] When Mary was nearby on 20 September, she had sent her trumpeter messenger to deliver the castle to the captain of her guard, but he was refused.[6] In October 1562 the Earl of Huntly sent Mary the keys of Findlater and Auchindoun, but she was suspicious of the low status of the messenger.[7]\nJames Ogilvy, 1st Earl of Findlater, was given the earldom in 1638. He built the nearby Cullen House to take the place of the castle as the family seat and by the time he died in 1653 it was little used and in decline.\nConservation\nThe castle is a scheduled monument.[8]\nReferences\nExternal links\nFindlater family site\nPortsoy poets site\nTake a 360 Virtual Tour of Findlater Castle\n57°41′32.60″N 2°46′13.47″W / 57.6923889°N 2.7704083°W / 57.6923889; -2.7704083\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1121,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.6923889",
      "lon": "-2.7704083"
    }
  },
  {
    "name": "Foveran Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Foveran_Castle",
    "text": "Castle in Scotland\n57°18′34″N 2°01′00″W / 57.3095°N 2.0166°W / 57.3095; -2.0166\nFoveran Castle was a 12th- or 13th-century castle, about 4.5 miles (7.2 km) south -ast of Ellon, Aberdeenshire, Scotland, at Foveran, 1 mile (1.6 km) west of the mouth of River Ythan.[1]\nIt may also be known as Turing's Tower,[1] or replace that castle. Foveran House Hotel lies 75 metres (246 ft) south -ast.[2]\nHistory\nThe Turings were the owners of the site. The castle collapsed around 1720. The site was acquired by Forbes of Tolquhoun around 1750.\nStructure\nThere is no longer any trace of the castle.[1] It appears that the arch over a spring, which was thought to have been at the base of the northern exterior wall, remained up until 1866.[3]\nTradition\nThomas the Rhymer is said to have prophesied:\nWhen Turing's Tower falls to the land\nGladsmuir shall be near at hand;\nWhen Turing's Tower falls to the sea,\nGladsmuir the next year shall be.\nIt is suggested that this relates to the Battle of Prestonpans, sometimes known as the Battle of Gladsmuir.[1]\nSee also\nCastles in Great Britain and Ireland\nList of castles in Scotland\nReferences\n^ a b c d Coventry, Martin (1997) The Castles of Scotland. Goblinshead. ISBN 1-899874-10-0 p.183\n^ \"Foveran Castle (site of)\". Stravaiging around Scotland. Retrieved 28 March 2020..\n^ \"Foveran Castle\". Canmore. Retrieved 28 March 2020.\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.3095",
      "lon": "-2.0166"
    }
  },
  {
    "name": "Freefield Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Freefield_Castle",
    "text": "Castle north of Inverurie, Aberdeenshire, Scotland\n57°22′13″N 2°32′20″W / 57.3703°N 2.5388°W / 57.3703; -2.5388\nFreefield Castle was a castle, about 11.5 miles (18.5 km) north of Inverurie, Aberdeenshire, Scotland, and 1 mile (1.6 km) west of North Rayne.[1]\nAlternatively it may be known at Freefield or Treefield.[2]\nHistory\nThe Leith family were the owners of the site. Leslie of Pitcaple killed George Leith of Freefield, starting a family feud.[1]\nStructure\nThere is no longer any trace of the castle.[1] Freefield House replaced it in 1754 (about 50 metres (160 ft) away), but it was shown on a map made by Gordon of Straloch in 1654.[3]\nCastles in Great Britain and Ireland\nList of castles in Scotland\nReferences\n^ a b c Coventry, Martin (1997) The Castles of Scotland. Goblinshead. ISBN 1-899874-10-0 p.183\n^ \"Freefield\". Canmore. Retrieved 1 April 2020.\n^ \"Freefield Castle (site of)\". Stravaiging around Scotland. Retrieved 1 April 2020..\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.3703",
      "lon": "-2.5388"
    }
  },
  {
    "name": "Fyvie Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Fyvie_Castle",
    "text": "Castle in Aberdeenshire, Scotland\nLocation of Fyvie Castle within the former Grampian region\nFyvie Castle - painting by James Giles\nFyvie Castle is a castle in the village of Fyvie, near Turriff in Aberdeenshire, Scotland.\nHistory\nThe earliest parts of Fyvie Castle date from the 13th century – some sources claim it was built in 1211 by William the Lion. Fyvie was the site of an open-air court held by Robert the Bruce, and Charles I lived there as a child for 4 years. Following the Battle of Otterburn in 1388, it ceased to be a royal stronghold as it was passed to Henry Preston as a reward from Robert iii.[clarification needed]. Instead, it fell into the possession of five successive families – Preston, Meldrum, Seton, Gordon and Forbes-Leith – each of whom added a new tower to the castle. The oldest of these, the Preston Tower (located on the far right as one faces the main facade of Fyvie), dates to between 1390 and 1433. The impressive Seton tower forms the entrance, and was erected in 1599 by Alexander Seton. He commissioned the great wheel staircase several years later. The Gordon Tower followed in 1777, and the Leith in 1890.\nInside, the castle stronghold features a great wheel stair, a display of original arms and armour, and a collection of portraits, from artists such as Henry Raeburn, Pompeo Batoni and Thomas Gainsborough.\nManus O'Cahan and Montrose fought a successful minor battle against the Covenant Army at Fyvie Castle on 28 October 1644. The battlefield was added to the Inventory of Historic Battlefields in Scotland in 2011.[1] Anne Halkett stayed at the castle from 1650 to 1652 with the Countess of Dunfermline, she treated wounded soldiers and the illnesses of local people, and negotiated with the English major of a company of Commonwealth soldiers, and with three Colonels, Lilburne, Fitts, and Overton.[2]\nThe grounds and adjoining Fyvie Lake were landscaped in the 18th century by Col. William Gordon. The Scottish industrialist Alexander Leith (later Baron Leith of Fyvie) bought the castle in 1885. His descendants sold it to the National Trust for Scotland in 1984.\nTo the east there is a walled garden where Scottish fruits are currently cultivated.[3] There is evidence for two other walled gardens closer to the castle itself to its west and south.[4] The one to the west appears on an estate plan of 1768.[5]\nGhostlore\nThe castle (like many places in Scotland) has ghostlore associated with it.[6] A story is told that in 1920 during renovation work the skeleton of a woman was discovered behind a bedroom wall. On the day the remains were laid to rest in Fyvie cemetery, the castle residents started to be plagued by strange noises and unexplained happenings. Fearing he had offended the dead woman, the Laird of the castle had the skeleton exhumed and replaced behind the bedroom wall, at which point the haunting ceased. It is said that there is a secret room in the south-west corner of the castle that must remain sealed lest anyone entering meet with disaster.[7] It is unclear if this is the same room in which the skeleton was found. There is also an indelible blood stain, two ghosts and two curses associated with this place.[8]\nOne of the curses has been attributed to the prophetic laird, Thomas the Rhymer. The curse is said to have been part of the mysterious three weeping stones. The curse decrees that until all three stones taken from the castle's boundary marks are brought together, the firstborn sons of the families who live at Fyvie will never inherit the castle. Only one weeping stone is known to exist and is kept at the castle. The other two have never been found, with one built into the castle walls and the other in the depths of the river Ythan. The second curse involves a hidden room in the charter room. The curse is very specific: death to the lord of the castle and blindness to his wife if anyone disturbs it.\nIn the media\nFyvie Castle has featured in a number of British television programmes, such as Living TV's Most Haunted series 6[9] and STV's Castles of Scotland.\nThe castle also played host of the setting of a children's gameshow on CBBC called Spook Squad in 2004.\n2009 saw the publication of the children's fantasy novel, The Time-Tailor and the Fyvie Castle Witch Trials, written by Deborah Leslie. The castle was also featured in the BBC documentary Castle Ghosts of Scotland,[10] narrated by Robert Hardy. In recent years, the castle grounds have hosted a Fyvie Live music festival in the summer, which was headlined in 2011 by Beverley Knight and in 2012 by Sophie Ellis-Bextor, then following a gap of several years, by The Shires in 2017. Following the revival, it was announced that the event would take place again in 2018, with Ward Thomas as the headline act. in August 2024 it also hosted re-enactors from all over the country to bring a re-enactment of the battle of Fyvie 1644.\nToday, the castle is open to tourists between April and October. It is also a wedding venue.\nSide view of the castle\nReferences\nExternal links\nFyvie Castle – National Trust for Scotland\nFyvie Castle Grounds Virtual Tour\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1211,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.4433",
      "lon": "-2.3949"
    }
  },
  {
    "name": "Gartly Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Gartly_Castle",
    "text": "57°22′13″N 2°46′37″W / 57.3703°N 2.7770°W / 57.3703; -2.7770\nGartly Castle was a 15th-century castle, about 1 mile (1.6 km) north-east of Gartly, Aberdeenshire, Scotland, and 4 miles (6.4 km) south of Huntly, east of the River Bogie.[1]\nHistory\nThe Barclays were the owners of the site from the 12th to the 16th century. Before her defeat of the Gordons at the Battle of Corrichie in October 1562, Mary, Queen of Scots stayed here.[1]\nThe castle ruins were demolished in 1975,[1] with the last remains removed by 1982.[2]\nStructure\nThere is no longer any trace of the castle, which had a keep.[1] In 1780 it was reported to Thomas Pennant that the castle was “an old building,.., placed on a small mount, and surrounded with a deep ditch. It is a square tower; one end of it is fallen down, and shews a section of strong vaulted rooms; but there seemed nothing so singular in its structure, as to merit more particular attention”.[2]\nGartly Castle was constructed on a natural mound about 17 metres (56 ft) across and up to 2.5 metres (8 ft 2 in) high. There was a ditch to the south, east and west.[3]\nCastles in Great Britain and Ireland\nList of castles in Scotland\nReferences\n^ a b c d Coventry, Martin (1997) The Castles of Scotland. Goblinshead. ISBN 1-899874-10-0 p.187\n^ a b \"Gartly Castle (site of)\". Stravaiging around Scotland. Retrieved 4 April 2020..\n^ \"Gartly Castle\". Canmore. Retrieved 4 April 2020.\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.3703",
      "lon": "-2.7770"
    }
  },
  {
    "name": "Huntly Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Huntly_Castle",
    "text": "Ruined castle in Scotland\nFor HM Castle Huntly, a 15th-century castle west of Dundee that is now used as a prison, see Castle Huntly.\nHuntly Castle is a ruined castle north of Huntly in Aberdeenshire, Scotland, where the rivers Deveron and Bogie meet.[1] It was the ancestral home of the chief of Clan Gordon, Earl of Huntly. There have been four castles built on the site that have been referred to as Huntly Castle, Strathbogie Castle or Peel of Strathbogie.[1][2]\nLocation\nHuntly Castle was built on the crossing of the rivers Deveron and Bogie, north of Huntly and roughly 40 miles from Aberdeen. The original wooden castle was built on a motte. The second castle, made of stone, was built on the northern end of the bailey. The third and modern castles were built to the east of the original, at the southern end of the estate.[2]\nHistory\nThe castle was originally built by Duncan II, Earl of Fife, on the Strathbogie estate sometime around 1180 and 1190.[2][1] The castle became known as the Peel of Strathbogie.[3]\nThe Earl Duncan's third son, David, inherited the Strathbogie estate and later, through marriage, became earls of Atholl around 1204.[1] During the Strathbogie family's time at the estate, Robert the Bruce was a guest after falling ill at Inverurie. The family was loyal to him and when he got better, Robert the Bruce went on to win the battle of Bannockburn.[3] However, around 1314, David of Strathbogie shifted his support to the English right before Robert the Bruce won the battle of Bannockburn. Robert the Bruce saw this as treachery and granted the castle and estate to Sir Adam Gordon of Huntly because he was consistently loyal. In 1506, the castle was officially renamed Huntly Castle.[2]\nReign of James IV\nAlthough the castle was burned to the ground, a grander castle was built in its place. In 1496, the pretender to the English throne, Perkin Warbeck, was married to Lady Catherine Gordon the daughter of George Gordon, 2nd Earl of Huntly, witnessed by King James IV of Scotland at Edinburgh. James IV came to Huntly in October 1501 and gave gifts of money to the stonemasons working on the castle. In October 1503, James IV came again and played in a shooting contest at a target called a \"prop\".[4] He came back again in the following October, on his way south, accompanied by four Italian minstrels and an African drummer known as the \"More taubronar\".[5] James IV played cards at the castle on 10 October 1505 and gave a tip to masons working on the building. These visits were part of his annual pilgrimage to the shrine of Saint Duthac at Tain.[6] Architecturally the L plan castle consists of a well-preserved five-story tower with an adjoining great hall and supporting buildings. Areas of the original ornate facade and interior stonework remain. Wings were added to the castle in the 16th and 17th centuries.\nCarved inscriptions feature on the facade\nReign of Mary, Queen of Scots\nWilliam Mackintosh was executed on 23 August 1550 at \"Castle Strathbogie\", as a conspirator against the Earl of Huntly, the queen's lieutenant in the North.[7]\nThe English diplomat Thomas Randolph stayed two nights in September 1562,[8] and wrote that the castle was \"fayer, beste furnishede of anye howse that I have seen in thys countrie.\"[9] Mary, Queen of Scots decided to take the castle, giving as a cause that the Earl withheld from her a royal cannon lent to him by Regent Arran.[10] She sent her half-brother John Stewart, Commendator of Coldingham to arrest the George Gordon, 4th Earl of Huntly at Huntly Castle in October 1562. On the day William Kirkcaldy of Grange and the Tutor of Pitcur arrived first and surrounded the house. While Kirkcaldy was talking to the castle porter, the castle watchman on the tower spotted Coldingham and the Master of Lindsay and their troops a mile off. He alerted the Earl, who ran without \"boot or sword\" and hopped over a low wall at the back of the castle and found a horse before Pitcur could stop him. Elizabeth Keith, Countess of Huntly then welcomed the queen's men and gave them a meal and showed them around the place. She still had her chapel furnished for Roman Catholic worship.[11]\nGeorge Gordon, 4th Earl of Huntly died after the Battle of Corrichie on 28 October 1562, and the castle was garrisoned for Mary, Queen of Scots by Charles Crawfurd and twenty soldiers. Furnishings including beds and 45 tapestries were carted to Aberdeen and shipped in barrels to Edinburgh for the royal collection and refurbishment by Servais de Condé.[12] After the surrender of Mary, Queen of Scots, at the battle of Carberry Hill, the Earl of Bothwell came north to meet George Gordon, 5th Earl of Huntly at \"Stawboggye\", and moved on to Spynie Castle after Huntly deserted his cause.[13] In July 1570 the exiled Earl of Westmorland found refuge at Huntly.[14]\nJohn Gordon, Earl of Sutheerland\nJohn Gordon, 11th Earl of Sutherland and his wife Marion Seton were poisoned at Helmsdale Castle in 1567 by Isobel Sinclair, the wife of Gordon of Gartly.[15] Isobel Seton's own son also died, but the fifteen-year-old heir of Sutherland, Alexander Gordon was unharmed. He was made to marry the Earl of Caithness' daughter Barbara Sinclair. In 1569 he escaped from the Sinclairs to Huntly Castle and remained at Huntly until he came of age in 1573. Barbara Sinclair died, and Alexander Gordon, now Earl of Sutherland, married Jean Gordon, former wife of the Earl of Bothwell, who had also found a refuge at Huntly Castle.[16]\nA fatal football match\nAn early description of the death of George Gordon, 5th Earl of Huntly in 1576, compiled by Richard Bannatyne gives some details of how the castle was used.[17] The Earl suffered a stroke, or a collapse caused by food poisoning, while playing football outside the Castle on the Green. He was taken through the outer gate to his bedchamber in the round tower of the palace block, which was then called the \"New Warke of Strathbogie.\" The Earl's bedchamber was adjacent to his \"Grit Chalmer\", the Great Chamber. After the Earl died, his body was laid out in the \"Chamber of Dais\", another name for the Great Chamber, and his valuables were secured in the bedchamber. After the Earl's steward left the castle, a number of alleged supernatural events occurred beginning with the sudden collapse of one of the servants in the \"Laich Chalmer\", Low Chamber. This \"Laich Chalmer\" was in another part of the castle, under a stair opposite the \"Auld Hall.\" On the following day, a servant went up to the Gallery at the top of the \"New Warke\" where spices (which were precious) were stored. This servant and two companions also collapsed and when revived complained of feeling cold. After the Earl's body was embalmed and taken to the chapel, his brother sat on a bench in the Hall by the Great Chamber door, and heard unexplained sounds from the chamber. It was said that \"there is not a live thing bigger than a mouse may enter in that chamber with the door locked.\"[18]\nEngraving of the castle by James Fittler in Scotia Depicta, published 1804\nRear courtyard ruins of Huntly Castle\nJames VI slights the castle\nIn March 1584 an English recusant Catholic Sir Thomas Gerard of Bryn was sent by Lady Ferniehirst to find refuge at Huntly.[19] George Gordon, 6th Earl of Huntly was a Catholic and James VI decided to subdue his power in the north. The king arrived at Huntly on 26 April 1589 after spending a night at Kintore. The Earl of Huntly had fled to the mountains, stripping the countryside and emptying the house of furniture. James brought 100 workmen to demolish the castle. Huntly sent the king an offer to spare the house and surrendered.[20]\nIn March 1593 a royal garrison of 16 men commanded by Archie Carmichael was to be put in Huntly Castle.[21] In May 1593 the Earl captured a man called Pedder in the lands of Atholl. Pedder was hanged and dismembered and his body parts displayed on poles at Huntly.[22]\nIn July 1594 Huntly was overseeing the building of a new hall and gallery.[23] Following the battle of Glenlivet, James VI came with workmen again and his master of works William Schaw, and planned to blow up the \"gret old tower\" which had been \"fourteen years in building\" on 29 October 1594.[24] The kirk minister Andrew Melville was with the king and a vocal advocate for demolition.[25] Aberdeen town council bought twenty stones in weight of gunpowder for the demolition of Huntly and other places,[26] and sent the stonemason John Fraser and other workmen to the demolition work at Huntly and Old Slains Castle, equipped with new shovels.[27]\nThe royal council met at Terrisoule to discuss the planned demolition on 28 October. Some Lords wanted the fortress kept to hold a loyal garrison. James VI still wished the whole castle, the new and old work, to be slighted.[28] It was decided not to completely demolish Huntly and Slains Castle and other houses, but preserve them for the convenience of the royal garrisons. It was also said that the pleas of the Countesses of Huntly and Erroll to save the houses were successful.[29] David Foulis wrote to Anthony Bacon that Henrietta Stewart, Countess of Huntly, watched the demolition at Huntly and was not allowed to have an audience with the king to plead her case.[30] The king made his friend Sir John Gordon of Pitlurg the keeper of the remaining buildings at Huntly.[31]\nRestored for a Marquess\nThe Marquess of Huntly restored and rebuilt the castle.[32] In 1746, an English soldier, James Ray, saw the ruins and commented on ceilings, still decorated with \"history-painting\".[33]\nHuntly spent large sums restoring and enlarging the castle in April 1597.[34] The restored facade of the main block was carved with the names and titles of the marquess, \"George Gordon\" and his wife, \"Henrietta Stewart\" who was a favourite of the queen, Anne of Denmark.[35] In February 1603 James VI made plans to resolve the Marquess's feuds including a royal visit to Huntly with Anne of Denmark and the Earl of Moray later in the year. The visit did not take place because of the death of Elizabeth I and the subsequent Union of the Crowns.[36]\nIn 1640 the Castle was occupied by the Scottish Covenanter army under Major-General Robert Monro (d. 1680). James Gordon Parson of Rothiemay tells us how the house \"was preserved from being rifled or defaced, except some emblems and imagery, which looked somewhat popish and superstitious lycke; and therefore, by the industry of one captain James Wallace (one of Munro's foote captaines) were hewd and brocke doune off the frontispiece of the house; but all the rest of the frontispiece containing Huntly's scutcheon, etc, was left untouched, as it stands to this daye.\"\nCaptured in October 1644, the castle was briefly held by James Graham, 1st Marquess of Montrose against the Duke of Argyll. In 1647 it was gallantly defended against General David Leslie by Lord Charles Gordon, but its 'Irish' garrison was starved into surrender. Savage treatment was meted out, for the men were hanged and their officers beheaded. In December of the same year the Marquess of Huntly himself was captured and on his way to execution at Edinburgh was detained, by a refinement of cruelty, in his own mansion. His escort was shot against its walls.\nAn inventory made by the garrison shows the state rooms were still fully furnished, including the earl's 'chapel bed'.[37] In 1650 Charles II visited briefly on his way to the Battle of Worcester, defeat and exile. The Civil War brought an end to the Gordon of Huntly family's long occupation of the castle.\nIn 1689, during the first Jacobite rising, the castle was briefly the headquarters for Viscount Dundee and his Jacobite army, at the end of April, just after the start of the revolt. However, by the early eighteenth century the castle was already in decay and providing material for predatory house builders in the village. In 1746, during a later Jacobite rising, it was occupied by British government troops. Thereafter, it became a common quarry until a groundswell of antiquarian sentiment in the 19th century came to the rescue of the noble pile.\nHuntly Castle remained under the ownership of the Clan Gordon until 1923. Today, the remains of the castle are cared for by Historic Environment Scotland as a scheduled monument.[38]\nPure Strength I, a major international strongman competition, was held on the grounds of Huntly Castle in 1987. The winner of the contest was Jón Páll Sigmarsson of Iceland.[39]\nReferences\n^ a b c d \"History\". www.historicenvironment.scot. Retrieved 12 February 2021.\n^ a b c d \"Huntly Castle Feature Page on Undiscovered Scotland\". www.undiscoveredscotland.co.uk. Retrieved 12 February 2021.\n^ a b \"Huntly Castle\". aboutaberdeen.com. Retrieved 12 February 2021.\n^ James Balfour Paul, Accounts of the Treasurer of Scotland, vol. 2 (Edinburgh, 1900), pp. xlix-l, 124, 401, for \"prop\" see 'Prop', Dictionary of the Older Scottish Tongue\n^ James Balfour Paul, Accounts of the Treasurer of Scotland: 1500-1504, vol. 2 (Edinburgh, 1900), pp. 462-4: Imtiaz Habib, Black Lives in the English Archives, 1500-1677 (London, 2008), p. 29.\n^ Accounts of the Treasurer of Scotland: 1506-1507, vol. 3 (Edinburgh, 1901), pp. 165, 168.\n^ James Balfour, Annals: The Historical Works of James Balfour, vol. 1 (Edinburgh, 1824), 297: Chronicle of the Kings of Scotland (Edinburgh, 1830), 92.\n^ John Guy, The Life of Mary Queen of Scots (Fourth Estate, 2009), p. 163.\n^ CSP. Foreign, Elizabeth, vol. 5 (London, 1867), nos. 648, 688, 718, 823: CSP. Scotland, vol. 1 (Edinburgh, 1898), p. 652.\n^ David Hay Fleming, Mary Queen of Scots (London, 1897), 77.\n^ Joseph Bain, Calendar State Papers Scotland, vol. 1 (Edinburgh, 1898), pp. 654-5, 657-8.\n^ Accounts of the Treasurer, vol. 11 (Edinburgh, 1916), p. 214, 217: Michael Pearce, Michael Pearce, '\"Beds of 'Chapel\" form in sixteenth-century Scottish inventories: the worst sort of beds', Regional Furniture, vol. 27 (2013), pp. 78-91\n^ Joseph Stevenson, Selections (Glasgow, 1837), p. 217.\n^ William Boyd, Calendar State Papers Scotland, vol. 3 (Edinburgh, 1903), p. 274.\n^ Fraser, William, ed., Sutherland Book, vol. 1 (Edinburgh, 1892), pp. 121-4, 127-9\n^ Margaret Sanderson, Mary Stewart's People (Mercat Press: Edinburgh, 1987), pp. 42-3.\n^ John Graham Dalyell, Journal of the Transactions in Scotland, by Richard Bannatyne (Edinburgh, 1806), pp. xviii, 483-492.\n^ Pitcairn, Robert ed., Bannatyne's Memorials of the Transactions in Scotland (1834), 334-5: McKean, Charles, The Scottish Chateau (Sutton, 2001), 109.\n^ William Boyd, Calendar of State Papers Scotland: 1584-1585, vol. 7 (Edinburgh, 1913), p. 36.\n^ Calendar State Papers Scotland, vol. 10 (Edinburgh, 1936), pp. 51-2.\n^ Annie Cameron, Calendar State Papers Scotland, vol. 11 (Edinburgh, 1936), p. 72 no. 43.\n^ Calendar State Papers Scotland, vol. 11 (Edinburgh, 1936), p. 91.\n^ Annie I. Cameron, Calendar State Papers Scotland, vol. 11 (Edinburgh, 1936), p. 375.\n^ Annie Cameron,Calendar State Papers Scotland, vol. 11 (Edinburgh, 1936), p. 470.\n^ Robert Pitcairn, Autobiography and diary of James Melville (Edinburgh, 1842), pp. 314, 319.\n^ David Masson, Register of the Privy Council, vol. 5 (Edinburgh, 1882), pp. 183-4.\n^ Spalding Club Miscellany, vol. 5 (Aberdeen, 1852), pp. 61-2\n^ David Masson, Register of the Privy Council, vol. 5 (Edinburgh, 1882), pp. 185-6.\n^ Calendar State Papers Scotland, vol. 11 (Edinburgh, 1936), p. 471 no. 398.\n^ Thomas Birch, Memoirs of the reign of Queen Elizabeth, vol. 1 (London, 1754), p. 192.\n^ Miscellany of the Spalding Club, vol. 1 (Aberdeen, 1841), p. 9.\n^ Calendar of State Papers Scotland, vol. 12 (Edinburgh, 1952), p. 512 no. 412: Charles McKean, Scottish Chateau (Sutton: Stroud, 2001), pp. 216-7.\n^ James Ray, A Journey Through Part of England and Scotland (London, 1747), p. 184\n^ Calendar of State Papers Scotland, vol. 12 (Edinburgh, 1952), p. 512 no. 412.\n^ Charles McKean, Scottish Chateau (Stroud, 2001), pp. 216-7.\n^ John Duncan Mackie, Calendar State Papers Scotland, 13:2 (Edinburgh, 1969), p. 1106 no. 897.\n^ Michael Pearce, '\"Beds of 'Chapel\" form in sixteenth-century Scottish inventories: the worst sort of beds', Regional Furniture, vol. 27 (2013), pp. 84-5: Michael Pearce, Whispers from An Age Gone By', Historic Scotland Magazine, (Winter 2016), pp. 16-18: Maria Hayward, Stuart Style (Yale, 2020), p.p. 244-5.\n^ Historic Environment Scotland. \"Huntly Castle (SM90165)\". Retrieved 27 February 2019.\n^ \"1987 Pure Strength Contest\". strongestman.billhenderson.org.\nExternal links\nWikimedia Commons has media related to Huntly Castle.\nHistoric Environment Scotland: Visitor guide\nMore photographs of Huntly Castle\nTake a 360 Virtual Tour of Huntly Castle Grounds\nEngraving of Huntly Castle by James Fittler in the digitised copy of Scotia Depicta, or the antiquities, castles, public buildings, noblemen and gentlemen's seats, cities, towns and picturesque scenery of Scotland, 1804 at National Library of Scotland\nVideo images and narration - Huntly Castle & Huntly Lodge\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1100,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.45488",
      "lon": "-2.78117"
    }
  },
  {
    "name": "Kildrummy Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Kildrummy_Castle",
    "text": "Ruined castle in Kildrummy, Aberdeenshire, Scotland\nKildrummy Castle is a ruined castle near Kildrummy, in Aberdeenshire, Scotland. Though ruined, it is one of the most extensive castles dating from the 13th century to survive in eastern Scotland, and was the seat of the Earls of Mar. It is owned today by Historic Environment Scotland and is open to the public as a scheduled ancient monument[1] with gardens that are included in the Inventory of Gardens and Designed Landscapes in Scotland.[2]\nHistory\nThe castle was probably built in the mid-13th century under Gilbert de Moravia. It has been posited that siting of Kildrummy Castle was influenced by the location of the Grampian Mounth trackway crossings, particularly the Elsick Mounth and Cryne Corse Mounth.[3] Kildrummy Castle underwent siege numerous times in its history, first in defence of the family of Robert the Bruce in August–September 1306 (leading to the executions of Nigel Bruce and many other Scots),[4] and again in 1335 by David of Strathbogie. On this occasion Christina Bruce held off the attackers until her husband Sir Andrew Murray came to her rescue.[5] In the reign of David II, Walter Maule of Panmure was warden of Kildrummy Castle.[6]\nIn 1403-4 Alexander Stewart, murdered Sir Malcolm Drummond and then took his widow, Isabel Douglas, Countess of Mar, by force and laid claim to Kildrummy and the title of \"Earl of Mar\". In 1435 it was taken over by James I and became a royal castle. In 1468 Henry Kinghorn was keeper of Kildrummy Castle for James III and spent £100 Scots on building works and repairs.[7] James IV granted the keeping of Kildrummy and its lands to Alexander Elphinstone, 1st Lord Elphinstone and his wife Elizabeth Barlow in 1507.[8]\nThe castle passed from the Clan Elphinstone to the Clan Erskine before being abandoned in 1716 following the failure of the Jacobite Rising of 1715.\nIn 1538 the castle was raided by John Strachan, the young laird of Lenturk, who took furnishings and fixtures. Strachan brought a blacksmith to remove the ironwork from the windows and doors. Some of the metal was turned into horseshoes and used to mend ploughs at the Kirktoun of Glenbuchat.[9]\nIn May 1585 Margaret Haldane, the wife of David Erskine, Commendator of Dryburgh, was held at Kildrummy in the custody of the Master of Elphinstone.[10] In 1645 Robert Farquharson of Invercauld was the keeper of Kildrummy Castle for the Earl of Mar and his son Lord Erskine. The laird of Glenkindie also helped to keep the castle, fearing the depredations that a garrison of outsider or \"stranger\" soldiers would make on his lands.[11]\nArchitecture\nKildrummy Castle is \"shield-shaped\" in plan with a number of independent towers. The flat side of the castle overlooks a steep ravine; moreover, on the opposite side of the castle the walls come to a point, which was once defended by a massive twin-towered gatehouse. The castle also had a keep, called the Snow Tower, taller than the other towers, built in the French style, as at Bothwell Castle. Extensive earthworks protected the castle, including a dry moat and the ravine. Most of the castle foundations are now visible, along with most of its lower-storey walls. Archaeological excavations in 1925 uncovered decorative stone flooring and evidence of battles.\nToday\nThe castle was given into the care of the Ministry of Works in 1951,[12] and is now owned by its successor organisation, Historic Environment Scotland. The castle and its gardens, in the quarry used to excavate stone for the castle, are both open to the public.[13][14][15]\nA hotel (the Kildrummy Castle Hotel) has been built on the old estate, overlooking the ruins.\nKildrummy Castle was the venue for the Scottish Sculpture Open, sometimes known as the Kildrummy Open, organised by the Scottish Sculpture Workshop from 1981 to 1997.[16]\nReferences\nExternal links\nWikimedia Commons has media related to Kildrummy Castle.\nHistoric Environment Scotland: Visitor guide\nTake a winter Virtual Tour around the Castle Ruins\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.235",
      "lon": "-2.905"
    }
  },
  {
    "name": "Lauriston Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Lauriston_Castle,_Aberdeenshire",
    "text": "Historic baronial fortress\nLauriston Castle stands on a clifftop site near the Aberdeenshire village of St Cyrus and just over a mile inland from the North Sea coast of Scotland. Once a royal fortress, it can claim to be one of the oldest privately owned and inhabited castles in the region. It is a Category C listed building.[1]\nHistory\n9th century\nBy tradition, it was the stronghold of Giric, Grig or Gregory the Great, one of the last of the Pictish kings (AD 878–889). The site of his church of Ecclesgreig (Eglise Grig) is nearby and he gave his Latin name, Ciricius, to St. Cyrus.[2]\n13th – 17th centuries\nLauriston’s first charter is dated 1243 and it soon developed into a classic courtyard castle which was savagely fought over during Scotland's Wars of Independence and strengthened by King Edward III in 1336 as part of the chain of strongholds which he hoped would prevent a French landing in support of the Scots.\nOne of the corner towers on the edge of the cliff was incorporated into a typical laird’s house in the 1500s. In turn, this house was absorbed into a very large Georgian mansion of Palladian design, dated 1765–89.\nFor nearly 450 years Lauriston was held by the Stratons, whose arms of 1292 are among the earliest recorded in Scotland.[3] The eloquent Declaration of Arbroath, the famous letter of 1320 to Pope John XXII, sealed by the nation’s earls and barons, has as its final signatory the name of Alexander Straton.\nAnother Straton, the “noble knicht o’ Lauriston”, fell at the Battle of Harlaw in 1411, and shortly afterwards his son was involved in the affair of the Sheriff’s Kettle. The barons of the Mearns had been complaining about the high-handed behaviour of John Melville of Glenbervie, Sheriff of Kincardineshire, and King James’s Regent, the Duke of Albany, exclaimed in exasperation that he would not mind if they \"biled the loon and suppit the bree\". Taking this as royal licence, a group of barons lured Melville to a hunting party, tipped him into a cauldron or kettle of boiling water and, to seal the conspiracy, supped the broth.[4]\nThe Stratons continued, however, to prosper at Lauriston, even surviving the events of 1534, when David Straton fell out with the Church over payment of tithes on the salmon fishery. He objected to giving every tenth fish to the Abbot of Arbroath and told “his servants to cast the tenth fish into the sea againe\", saying that God could catch his own. For this evasion of Church taxes he was taken to Edinburgh and condemned to death, thus becoming one of Scotland's first Protestant martyrs.[5]\n17th – 18th centuries\nIn 1695, the Stratons were forced to sell Lauriston. Under the charter to the new owner, Court of Session Judge, Sir James Falconer of Phesdo, the estate became a burgh of barony, with a freeport at Miltonhaven.[6][7] The name of the barony was also changed to Miltonhaven, but storms in the 1790s swept away both the port and village, leaving Lauriston to be known as “The Drown’d Barony”. Over the following century, the policies were developed in fashionable Picturesque style, with waterfalls, walks and a two-acre walled garden.\n20th century\nFollowing its use as RAF barracks during World War II, part of the mansion was demolished, and according to Nigel Tranter, the castle had “fallen on evil days indeed”.[8][9]\nLauriston's Great Hall and Doocot Tower were rebuilt in the late 1980s by William and Dorothy Newlands of Lauriston to plans drawn up by architect Ian Begg.[10] The doocot received a Glenfiddich Living Scotland Award in 1992.\nLady Lauriston is chair of the Scottish Castles Association.\nReferences\n56°47′23″N 2°23′44″W / 56.7896°N 2.3955°W / 56.7896; -2.3955\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1243,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.7896",
      "lon": "-2.3955"
    }
  },
  {
    "name": "Lonmay Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Lonmay_Castle",
    "text": "The remains of the Castle of Lonmay are found near Netherton of Lonmay, to the north of Loch Strathbeg in Buchan, Scotland. The remains are not located in the modern village of Lonmay which is approximately 6 km to the south-west. It was described by W. Douglas Simpson as one of the nine castles of the Knuckle, referring to the rocky headland of North-East Aberdeenshire.[1][2]\nDating from the 13th century it was home to the Fraser family.[3]\nThe castle \"may have been a motte\".[4] It has long ceased to be in existence and there are very few remains to be found, all of which are buried under constantly shifting sand dunes that have over time engulfed the site.[5]\nThe castle provided protection to the north shore of the estuary[6] that used to flow into Strathbeg Bay, before it closed off forming Loch Strathbeg around 1720. The south-shore (with Starny Keppie harbour and the village of Rattray) was protected by the Castle of Rattray.\nThe remains are found \"in the Links\".. \"near the sea\"[7] however \"all the stones have been carried off, and employed in building farm-houses\"[7] and so \"except the name, all tradition respecting this building is lost\".[7]\nReferences\nExternal links\nThe Castle is not normally included on modern maps (Ordnance Survey grid-reference: NK061608), but this 1931 OS map of the area shows the remains of Lonmay Castle to the north of Loch Strathbeg as \"Site of Castle\".\nImages of the immediate local area (though not the castle site) from the Geograph project.\n57°38′16.05″N 1°53′49.14″W / 57.6377917°N 1.8969833°W / 57.6377917; -1.8969833\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.6377917",
      "lon": "-1.8969833"
    }
  },
  {
    "name": "Migvie Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Migvie_Castle",
    "text": "Migvie Castle was a 13th-century castle to the west of Migvie, Aberdeenshire, Scotland.[1] Its remains were listed as a scheduled monument in 2007.[2]\nHistory\nThe castle occupies an important and commanding position along the old north road leading from Aboyne to Strathdon. First mentioned in a charter in 1268 by Uilleam, Earl of Mar, the castle was the seat of the Lord of Cromar and caput of the barony of Cromar. Migvie was later held by the Rutherfords of Tarland in the 1440s and from 1452 it passed to Alexander Gordon, Earl of Huntly.\nSlight traces of the castle's curtain wall are visible above ground.[1]\nReferences\n^ a b Coventry, Martin (2001). The Castles of Scotland. Musselburgh: Goblinshead. p. 233. ISBN 1-899874-26-7\n^ Historic Environment Scotland. \"Migvie Castle (SM11470)\". Retrieved 17 March 2020.\nExternal links\nMigvie Castle—Royal Commission on the Ancient and Historical Monuments of Scotland listing\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1268,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.1468",
      "lon": "-2.9331"
    }
  },
  {
    "name": "Castle of Rattray",
    "wikiPage": "https://en.wikipedia.org/wiki/Castle_of_Rattray",
    "text": "Old medieval Scottish castle\nFor Craighall Castle, the castle of Clan Rattray, see Blairgowrie and Rattray.\nCastle Hill in 2008, all that is left of the original site\nRattray Castle, one of the nine castles of the Knuckle The Castle of Rattray was a medieval Scottish castle, with multiple variations on its structure over approximately six centuries. Originally built as a \"late 12th- or early 13th century defensive motte\"[1] it provided protection for Starny Keppie Harbour and Rattray village. Sometime between 1214 and 1233 it was upgraded by William Comyn, jure uxoris Earl of Buchan before being destroyed in the 1308 Harrying of Buchan. After Comyn's timber castle was burned down, it was replaced by a stronger stone castle which was engulfed during a 1720 sand storm along with nearby Rattray village. After the storm, the castle was not dug out and remains covered to this day. The castle was described by W. Douglas Simpson as one of the nine castles of the Knuckle, referring to the rocky headland of north-east Aberdeenshire.[2]\nLocation\nThe castle was sited on Castlehill, on the south bank of the now-closed estuary flowing into Strathbeg Bay- the north bank was protected by the opposite Lonmay Castle.[3] Specifically the castle was \"beside an inlet which led from the sea into a sheltered harbour\"[4] on \"the harbour side\" of Rattray village.[3] The later stone castle is known to have had a \"harbour-side entrance\".[5]\nOriginally situated on \"a rock near the sea\",[6][7] Castlehill is today about 1 mile inland as shifting sands have significantly altered the shape of the coast. Located to the south of Loch Strathbeg it can be seen as a grassy \"circular mound\"[8] which is \"oval & natural with its top slightly dished\".[5] A 1791 book states it has a \"summit\"... [of] \"half a Scots acre\"[9] (approx. 0.25 hectare) and \"rises 38 feet\"... (11.6 metres) \"above a small plain on the\"... north-east \"but is only 12 or 14 feet\"... (3.7 or 4.3 metres) \"above the higher ground\"[10] to the south-west.\nHistory\n1100 AD to 1200\nThe first construction of Castlehill was a small keep during the late middle ages, or a 12th century \"timber castle or Motte\"[4] built to protect the estuary.\nComyn period (1200 to 1308)\nIn the 13th century, the Castle of Rattray was \"the principal seat of the Cummings\"... [alt. spelling of Comyn] \"Earls of Buchan\"[11] who arrived at the start of that century. Between 1214 when he inherited the Earldom of Buchan and his own death in 1233, William Comyn, jure uxoris Earl of Buchan[7][8] built upon the motte but it is unclear whether he upgraded the existing buildings or built an entirely new castle. He is known to have completed a \"manor house\"[4] with \"a fine timber-framed hall\"[4] (the castle) which was accompanied by the private St Mary's Chapel which he constructed \"a quarter of a mile\"[10] (0.4 kilometres) south, in Rattray village itself.\nIn the mid-1270s, it is reported that \"a castle-strengthening programme Rattray\"[12] took place.\nComyn's castle survived until the Harrying of Buchan in the summer of 1308,[6] when all the Comyn lands were bloodily burned to the ground after John Comyn, Earl of Buchan was beaten at the Battle of Barra. The timber Rattray Castle was almost certainly attacked by Robert the Bruce or his younger brother Edward after which the \"castle fell into ruins\"[10] if not burned to the ground.\n1308 to ~1720\nFollowing the harrying, the site of Rattray's timber castle was rebuilt with a \"stone-built hall\".[4] This stone incarnation provided protection for Starnie Keppie Harbour and the village of Rattray, as the previous incarnations did.\nThe Earldom of Buchan and hence the castle was inherited and divided after the harrying between John Comyn's two nieces.[13] Henry de Beaumont, the husband of one niece; Alice Comyn, claimed the title under her name but was disinherited from the lands in 1314. A 1324 charter from Robert the Bruce then gives the \"lordship of Rattray\" to Sir Archibald Douglas.[14] The lands again change hands in 1382 when Alexander Stewart was given the Earldom by his father Robert II of Scotland.\nMary, Queen of Scots, declared Rattray a Royal Burgh in 1563 \"to put an end to the disputes about superiority over it between William Keith, 4th Earl Marischal and George Hay, 7th Earl of Erroll\".[7] The importance of the Burgh is questionable due to the fact \"it does not appear to have long enjoyed that privilege not being ranked in the roll of boroughs for many ages\" [15] and as it was \"said to have had all the privileges of a royal borough, except sending members to parliament.\"[16]\nIn later years Rattray was run by a feudal system of superiors who maintained the land for the Crown, some of whom are known due to charters that they granted. \"David Rivis\"... \"superior of the lands of Rattray\"[17] granted a charter in 1617; \"William Watson of Haddo, bailie of the burgh of Rattray, superior\"[17] [of Rattray] granted a charter in 1675 and \"Charles\".. [Hay, 13th] \"Earl of Erroll, superior of the lands of Rattray\"[17] granted a charter in 1711.\nThe destruction of the stone castle and the nearby village of Rattray, is said by \"a tradition\"[7] to have happened during the great storm of 1720[18] which cut off Strathbeg Bay. It is believed that the castle was \"blown over with sand one Sunday evening while the\"[7] inhabitants, \"a godless crew\".[18] \"were engaged in playing cards\".[7] \"on the Sabbath, [when] they were buried alive.\"[18]\nAnother story says that the site was \"buried because of the plague.\"[7] However there is no date or record of which plague and it is a very unlikely account.\n~1720 to 1988\nToday there is not much to be seen at the site as the remains have \"for a long period [been] covered with a deep soil, and now- the swords of the warlike house beaten literally into ploughshares\".[19] In c. 1730, a dig at the south-east \"side of the Castle Hill\"... \"found a great number of stones, supposed to belong to the kitchen of the castle, as\"... \"workmen found very large hearthstones covered with ashes.\"[20]\nItems recovered include; \"a quantity of regularly-laid stones were removed c. 1734 and some silver coins\"[5] as well as two kilns stands found in 1829 (today held in Marischal Museum, Aberdeen).[21]\nIn 1740 \"a man who drove his spade through the panel of a door was immediately suffocated\"[7] having got caught in the sand and at an unknown date, a \"well-made causeway was discovered at the foot of the mound under which the Castle is said to be buried.\"[7]\n1985-1989 Excavations\nThorough excavations at Castlehill in 1985-1989 revealed the remains of the stone castle and traces of the previous timber one.[5] Traces of the stone castle revealed a \"perimeter wall\".. and \"two mural buildings\".[5] It also ascertained that the later stone castle was approximately \"20m by 6.5 m\"[5] and \"divided into three parts, a central room, and two smaller end rooms\".[5] It likely supported more than one storey, due to the \"indication of a possible forestair\"... and \"the wall thickness.\"[5]\nThe results of this excavation can be found in the Journal article (available free from the link in the journal citation below) \"Excavations at Rattray, Aberdeenshire. A Scottish deserted burgh\" by \"Murray & Murray\" and forms the most complete modern and peer-reviewed academic account of the Castle of Rattray available to historians and archaeologists today.\n1989 to present\nAberdeen City Council today holds various artefacts from Rattray and the Castlehill site and has previously held a temporary display of artefacts at James Dun's House in Aberdeen.\nReferences\nNotes\nBooks\nBruce, Stanley (2005). The Bard O' Buchan. Vol. 1. Bard Books. ISBN 0-9547960-2-0.\nFraser, J. (1859). Fraser's Magazine for Town and Country. Vol. LX, July to December 1859. West Strand, London: John W. Parker and Son.\nKennedy, William (1818). Annals of Aberdeen, from the Reign of King William the Lion, to the End of the Year 1818. A. Brown and Co., Aberdeen.\nPlayfair, James (1819). A Geographical and Statistical Description of Scotland. Archibald Constable And Company; Edinburgh.\nRobertson, Joseph (1847). Illustrations of the Topography and Antiquities of the Shires of Aberdeen and Banff (in English and Latin). Aberdeen: Printed for the \"Spalding Club\".\nSinclair, John (1791). The Statistical Account of Scotland: Drawn Up from the Communications of the Ministers of the Different Parishes. William Creech. OCLC 4261705.\nYoung, Alan (1997). Robert the Bruce's Rivals: The Comyns, 1212-1314. Tuckwell Press. ISBN 1-86232-053-5. OCLC 37976670.\nJournals\nBuchan Field Club (1892). \"Excursion to Loch Strathbeg and Vicinity\". Transactions of the Buchan Field Club. 1-2 (1887-1892): 82–85. ISSN 0959-2806. OCLC 22144239. Archived from the original on 3 March 2016. Retrieved 11 June 2007.\nMurray, H. K.; Murray, J. C. (1993). \"Excavations at Rattray, Aberdeenshire: A Scottish deserted burgh\" (PDF). Journal of the Society for Medieval Archaeology. 37: 109–218. doi:10.1080/00766097.1993.11735559. ISSN 0076-6097. OCLC 1607565.\nExternal links\nArtists impressions of the site from the Scran database of: 12th to 13th-centuries; 13th century; 14th century.\n57°36′36″N 1°51′16″W / 57.61011°N 1.85438°W / 57.61011; -1.85438\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1100,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.61011",
      "lon": "-1.85438"
    }
  },
  {
    "name": "Slains Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Old_Slains_Castle",
    "text": "Historic site\nSlains Castle (otherwise known as Old Slains Castle) is a ruined castle near Collieston in Aberdeenshire, Scotland. It is not to be confused with New Slains Castle, a separate building located five miles (eight kilometres) northeast. Built in the 13th century, it was partly destroyed in 1594.\nHistory\nThe 13th-century castle was originally the property of the Comyn, Earl of Buchan. After the forfeiture of the Comyns in the 14th century it was given to Sir Gilbert Hay by Robert the Bruce in recognition for his support against the English.[1]\nSlains Castle next comes into prominence when Francis Hay, 9th Earl of Erroll took part in a Catholic Rebellion in the north of Scotland. King James VI came to Abedeen in April 1589 and placed a garrison of soldiers at Slains Castle.[2] In January 1593, the Earl of Erroll was said to have welcomed so many English and Scottish Catholics in a tower at Slains that he was put to great expense.[3] The rebellion culminated in the Battle of Glenlivet in 1594, which left the Catholic army substantially weakened, and the rebellion collapsed. James VI marched north with an army intent on capturing the leaders of the rebellion, including Francis Hay, however they evaded capture.[4] He then proceeded to blow up their castles, including Old Slains Castle. At the king's request, Aberdeen Council provided 20 stone (130 kilograms) weight of gunpowder together with pickaxes and other tools, required for ‘demolishing and casting down of houses and fortalices to the sum of 548 pounds six shillings’.[5] The castle was destroyed with gunpowder and cannon on 1 November.[6] Aberdeen town council sent the stonemason John Fraser and other workmen to the demolition work at Huntly Castle and Slains, equipped with new shovels.[7] Two walls meeting at a corner survived the explosion. (Old) Slains Castle. What remains after it was blown up with gunpowder in 1594. Next year, Elizabeth Douglas, Countess of Erroll, a friend of Anne of Denmark, hired masons to repair the building.[8] However, it was beyond saving. She then moved into the farmhouse of Clochtow, 1⁄2 mile (800 metres) northwest of the ruined castle. She remained in this ‘mean abode, and continued there sometime after 1597, when the honours and estates were restored... The Countess, all her remaining days, preferred to her noble title of Countess of Erroll the plain designation of “Guidwife of Clochtow”, because this designation had never been taken by the crown from her, and she had been known by it during the period of her husband’s exile, when he was a wanderer abroad, and only plain “Francis Hay”.’[9] Francis Hay later built a tower house called Bowness on what is now the site of New Slains Castle.[10]\nStructure\nOriginally a strongly built 5-storey oblong keep (of which a small part remains), a wall defending the landward side was added in the early 16th century.\nModern day\nTwo sections of wall remain standing, at approximately 25 metres (82 ft) in height. The south-facing wall partially collapsed on 31 May 1979. An estimated 100 tons of rubble fell on the road next to the castle, blocking the road and partially burying a lorry.[11] In the 1950s, a 3-storey house was built within the ruins, adjoining a fishing cottage built in the 18th century. Since 1991 several archaeological excavations have been carried out, the last one in 2007.[1][citation needed] The remains of the old castle are designated as a scheduled ancient monument.[1]\nReferences\nFurther reading\nAitken, Margaret. Six Buchan Villages Re-visited (2014)\nMoncreiffe, Iain. Slains and the Errolls (1973)\nShepherd, Mike. When Brave Men Shudder: The Scottish origins of Dracula (2018)\nShepherd, Mike and Stoker, Dacre. Slains Castle’s Secret History (2021)\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.3609",
      "lon": "-1.91438"
    }
  },
  {
    "name": "Wardhouse Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Wardhouse_Castle",
    "text": "Scottish castle\nWardhouse Castle was a 13th-century tower house, about 2.5 miles (4.0 km) west of Insch, Aberdeenshire, Scotland.[1]\nThe castle was called Weredors, Wardes Castle [2] or simply Wardhouse.[1]\nHistory\nSir Bartholomew the Fleming owned the property in the 13th century.[2] The castle was in the lands of the John Erskine, Earl of Mar as feudal overlord in 1566, but the rents were used to pay royal trumpeters.[3]\nIn the 16th century the property belonged to the Leslies; the Gordons acquired it.[1] It was in ruins by 1790, and demolished, along with a neighbouring building, shortly before 1842.[2]\nClan member crest badge - Clan Leslie\nClan member crest badge - Clan Gordon\nStructure\nWardhouse Castle was an enclosure castle. Only ditches and earthworks remain.[1]\nThe building was very tall, with very thick walls which had a few slit windows. The lower storey was arched; the building was reached by a drawbridge. There was a moat.[2]\nBy the late 20th century all that was visible of the site, which had been degraded by ploughing, was a natural oval mound, mainly natural, which measured about 60 metres (200 ft) from south east to north west by 30 metres (98 ft), surrounded by mere traces of a ditch. Other than the north eastern flank the natural profile has been changed. cropmarks showed ditches of an outer line of defence, which have been located by excavation.[2]\nSee also\nCastles in Great Britain and Ireland\nList of castles in Scotland\nReferences\nExternal links\nWardhouse Castle, excavation summary, Aberdeenshire Council\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "57.348593",
      "lon": "-2.677951"
    }
  },
  {
    "name": "Auchterhouse Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Auchterhouse_Castle",
    "text": "Auchterhouse Castle is a c. 13th-century castle located northwest of Dundee, Angus, Scotland.[1] The original castle was enclosed with walls, towers, and contained a keep. The castle may have been in ownership of the Ramsay family, who were hereditary sheriffs of Angus. Sir William Wallace is alleged to have stayed at the castle, and one its towers was named in his honour. King Edward I of England spent the night of 20 July 1303 at the castle. The castle came into the possession of James Erskine, 7th Earl of Buchan, who may have built the 17th-century tower house.\nReferences\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.522857",
      "lon": "-3.088781"
    }
  },
  {
    "name": "Baikie Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Baikie_Castle",
    "text": "Baikie Castle, was a castle on the shores of the former Loch of Baikie, Angus, Scotland. The castle was owned by the Fenton family from the 13th century until the 15th century, when it passed to the Lyon of Glamis family.[1] The castle was surrounded by a moat, with a drawbridge and stone causeway providing access to the castle. No remains were evident by the 19th century.\nCitations\nReferences\nCoventry, Martin. (2008) Castles of the Clans: the strongholds and seats of 750 Scottish families and clans. Musselburgh.\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": false
    },
    "coordinates": {
      "lat": "56.6307",
      "lon": "-3.1125"
    }
  },
  {
    "name": "Forfar Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Forfar_Castle",
    "text": "Forfar Castle was an 11th-century castle[1] to the west of Forfar, Scotland.[2]\nHistory\nThe castle was apparently surrounded by water and was used as a royal castle by the Scottish kings Malcolm III, William I and Alexander II.[2] Malcolm used it as a base for raising an army to repel Danish invaders.[1] The castle was surrendered to the English and was garrisoned by Edward I of England, who visited it in 1296. King Robert I of Scotland captured the castle in 1306 and burned it. The castle rebuilt by the English and was in English hands when Scots, led by Philp the Forester of Platan, recaptured it on Christmas Day, 1308, and slaughtered the garrison. After demolition and rebuilding in 1308, the castle was destroyed again in 1313 and was abandoned by the 1330s.[2]\nNo trace of the castle remains above ground, although there were remains up to the 17th century.[2]\nReferences\n^ a b \"Royal Forfarr\". Visit Angus. Angus Council. Archived from the original on 9 March 2016. Retrieved 2 September 2015.\n^ a b c d Coventry, Martin (2001). The Castles of Scotland. Musselburgh: Goblinshead. p. 218. ISBN 1-899874-26-7\nGeneral\nForfar, Castle Hill—Royal Commission on the Ancient and Historical Monuments of Scotland listing\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "11th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.646",
      "lon": "-2.890"
    }
  },
  {
    "name": "Montrose Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Montrose_Castle",
    "text": "Castle in Angus, Scotland, UK\nMontrose Castle was a 12th-century castle built in Montrose, Angus, Scotland.[1] Montrose was created a royal burgh by King David I of Scotland in the 12th century. The castle, once a royal castle, was built as a motte and bailey castle. King Edward I of England accepted John Balliol's surrender of Scotland at the castle on the 10 July 1296. The castle was destroyed by William Wallace in 1297. The castle was noted to be in ruins in 1488. Nothing now remains above ground.\nCitations\nReferences This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Montrose\". Encyclopædia Britannica (11th ed.). Cambridge University Press.\n56°42′29″N 2°28′26″W / 56.708°N 2.474°W / 56.708; -2.474 <img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "12th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.708",
      "lon": "-2.474"
    }
  },
  {
    "name": "Ardencaple Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Ardencaple_Castle",
    "text": "Former castle near Helensburgh\nArdencaple Castle, also known as Ardincaple Castle, and sometimes referred to as Ardencaple Castle Light, is a listed building, situated about 1 statute mile (1.6 km) from Helensburgh, Argyll and Bute, Scotland.[2][3] Today, all that remains of the castle is a tower, perched on the edge of a plateau, looking down on a flat tract of land between it and the shore of the Firth of Clyde.[4] The original castle was thought to have been built sometime in the 12th century,[5] and part of the remains of the original castle were said to have existed in the 19th century.[2] Today, that sole remaining tower is used as a navigational aid for shipping on the Firth of Clyde. Because of its use as a lighthouse the tower has been called Ardencaple Castle Light.[6]\nLairds of Ardincaple\nThe word Ardencaple or Ardincaple has been said to be derived from the Gaelic Ard na gCapull, meaning \"cape of the horses\", or \"of the mares\", or \"height of the horses\".[7][8] In 1351 this place name was recorded as Airdendgappil.[7] From the Middle Ages the lands of Ardencaple were controlled by the Lairds of Ardincaple. By the late 15th century or 16th century the lairds had adopted the surname MacAulay. By this time the Laird of Ardincaple was considered the clan chief of Clan MacAulay.\nThe fortunes of the Lairds of Ardincaple failed in the 18th century, and they were forced to divide and sell, piece by piece, the lands of Ardincaple and their other estates to pay debts. Archibald MacAulay, 9th laird (died 1752), began the process around 1700,[9] and the sales continued under his sons - one of whom wrote a primer on shorthand in an effort to raise money.[10] By the time the 12th laird died around 1767, the roof had fallen in and the overall condition of the castle had deteriorated to such an extent that he had been forced to abandon his residence there and live in nearby Laggarie, having completed the sale of the MacAulay estates.[9]\nRenovations to the Ardincaple Estate\nSketch by Robert Adam of his planned addition to Ardincaple Castle in 1774.\nThe estate was then purchased by John Campbell, 4th Duke of Argyll,[11] and remained in possession of the Campbells well into the 19th century. It was during the Campbell's tenure as lairds of Ardencaple in the 18th century that extensive development was done on the estate by Robert Adam - Scotland's foremost architect of the time. In 1764, while the house was in possession of Lord Frederick Campbell, Robert Adam was first consulted about work on the castle. The house was then irregularly shaped, and Adam came up with a plan for the addition of castle-style additions on the western side of the house which faced the Gare Loch. However, nothing came of this scheme and it wasn't until 1774 that Adam came up with a set of drawings for an addition to the southern half of the west front of the house. This addition was made up of three-bay-windowed, D-shaped tower set in between two smaller turrets (pictured left). Later photographs of Ardincaple Castle show that Adam's extension had been altered or that some features present in his sketch were omitted from being implemented. For instance, the conical roofs, the crow-stepped gable in the sketch do not appear in photographs of the castle. Photographs of Ardincaple Castle show that the tower and southern turret had one more storey than appear in Adam's sketch According to David King, it is possible that Adam was responsible for the added extra floor to the tower, but that is it very unlikely Adam altered the turret because the altered turret broke the symmetry of the addition. Also, Adam had planned that the tower would contain a D-shaped dressing room on its main floor (upper floor). However, it was later decided to make the room oval shaped. David King remarks that Adam had planned a pleasant ceiling for this room, but that there is no sign of it in photographs of 1957.[12] George Campbell, 8th Duke of Argyll was born at Ardencaple Castle on 30 April 1823.[13] By 1852 the Duchess Dowager of Argyll sold the Ardencaple estate to the wealthy Colquhouns of Luss.[14] Ardencaple Castle Light. Today the tower is used as a navigational aid for shipping on the Firth of Clyde. Photo by Robie Macauley.\nModern era and destruction of the castle\nIn 1923, Sir Iain Colquhoun sold the castle to Mrs. H. Macaulay-Stromberg,[15] a wealthy American, who restored the castle and lived there until her death, in 1931.[16] The castle then passed to Adelaide Parker Voorheis until 1935,[16] when it passed to a consortium of developers who had constructed, in 1936-1937 a housing estate on what used to be the Tower Lawn.[16] The castle then was requisitioned by the Royal Navy[16] with the outbreak of World War II.\nIn 1957 most of the castle was demolished by the government in order to build naval housing for the nearby HMNB Clyde (Faslane Naval Base & Royal Naval Armaments Depot, Coulport), though one tower was left to be used as a mount for navigational beacons and transit lights for the Royal Navy.[17] From then on, the 45-foot (14 m) high tower was known as \"Ardencaple Castle Range Rear Light\", and had two green lights mounted on its south-west corner.[1] Ardencaple Castle has been considered a Category B listed building since 14 May 1971.[3] Today, all that remains of the grand turreted mansion is one solitary tower.\nGallery\nWikimedia Commons has media related to Ardencaple Castle. Sometime before 1869 Photo taken around 1900 Grand fireplace, 1937 See also\nClan MacAulay\nRhu\nHelensburgh\nReferences\nWikimedia Commons has media related to Ardencaple Castle.\nArdencaple Castleclass=notpageimage| Location in Scotland.\n56°0′32.88″N 4°45′25.09″W / 56.0091333°N 4.7569694°W / 56.0091333; -4.7569694\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "12th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.0091333",
      "lon": "-4.7569694"
    }
  },
  {
    "name": "Aros Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Aros_Castle",
    "text": "Aros Castle, also known as Dounarwyse Castle, is a ruined 13th-century castle near Salen on the Isle of Mull, Scotland. The castle overlooks the Sound of Mull.\nHistory\nThe castle was probably built by one of the MacDougall lords of Lorn in the 13th century. Documentary evidence from the late 14th century records it as Dounarwyse Castle in the possession of the Lords of the Isles. The castle was initially a stronghold of the Clan MacDougall. When they backed the losing side in the dispute between Edward I and Robert de Bruys, their lands were declared forfeit and the castle was given by King Robert to Angus Og of Islay Lord of the Isles and Clan Donald. During the late 14th and 15th centuries, it was used as an occasional base by the Lords of the Isles, at which time it was known as Dounarwyse Castle. When, some centuries later, the latter tried to conquer Scotland, they too had their lands declared forfeit, and this time Clan Maclean gained the Castle at MacDonald expense.\nLord Ochiltree entertained the Island Chiefs here in 1608 before making them prisoners. It was described as 'ruinous, old, useless and never of any strength' in 1688 but seems to have been garrisoned by Argyll's troops in 1690. No evidence exists of any occupation in the 18th century or later.\nStatus\nIt is a scheduled monument that includes the 13th-century hall-house and bailey with traces of other buildings, possibly of a later date, and a small stone-built galley landing east of the bailey.[1] References\nRoyal Commission on the Ancient and Historical Monuments of Scotland listing - Aros Castle, CANMORE\nMike Salter, Castles of Western and Northern Scotland 1995\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.5321",
      "lon": "-5.9649"
    }
  },
  {
    "name": "Claig Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Claig_Castle",
    "text": "Claig Castle as it appears today\nClaig Castle was a stronghold of the Clan Donald or MacDonald in the south of Scotland.\nHistory\nThe castle was once a massive fort described as a sea fortress, which allowed the Macdonald Lord of the Isles to dominate and control the sea traffic north and south through the Hebrides for more than four centuries. However, the vast majority of its fortifications were constructed in the 15th century.\nThe castle remained a stronghold of the MacDonalds until they were subdued in the 17th century by the Clan Campbell.\nLocation\nThe castle is located at grid reference NR471627 on the island of Am Fraoch Eilean which is just off the island of Jura.\nSee also\nCastles in Scotland A list of Scottish castles.\nClan Donald\nExternal links\nAm Fraoch Eilean, Claig Castle\n55°47′29″N 6°2′7″W / 55.79139°N 6.03528°W / 55.79139; -6.03528\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": null,
      "pre1291Found": false,
      "post1291Found": false
    },
    "coordinates": {
      "lat": "55.79139",
      "lon": "-6.03528"
    }
  },
  {
    "name": "Duart Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Duart_Castle",
    "text": "Castle in Scotland\nAerial of Duart Castle, Isle of Mull\nDuart Castle\nClan MacleanClan Maclaine\nBranches\nMaclean of Duart\nMaclean of Coll\nMaclean of Ardgour\nLands\nArdgour\nColl\nCastles\nDuart Castle\nGlensanda Castle\nSepts\nBeath\nBeaton\nBlack\nGarvie\nLean\nMacBeath\nMacBheath\nMacBeth\nMacEachan\nMacilduy\nMacLaine\nMcLean\nMacLergain\nMaclergan\nMacRankin\nMacVeagh\nMacVey\nRankin\nDuart Castle, or Caisteal Dhubhairt in Scottish Gaelic, is a castle on the Isle of Mull, beside the Sound of Mull off the west coast of Scotland, within the council area of Argyll and Bute. The castle dates back to the 13th century and is the seat of Clan MacLean.[1] One source states that the castle was \"brought back from ruin in 1911\".[2] The regimental colours of the WW1 Canadian Expeditionary Force 236th Battalion (New Brunswick Kilties), CEF are laid up in the Great Hall.\nHistory\nDuart Castle was probably built by Clan MacDougall in the 13th century, and appears to have come into the hands of Clan MacLean in the following century.[3]\nIn 1350, Lachlan Lubanach Maclean of Duart, the 5th Clan Chief, married Mary Macdonald, daughter of John of Islay, Lord of the Isles, and Duart was part of her dowry.[4] John of Islay's son, Donald Macdonald, Lord of the Isles, confirmed the castle by charter to the Macleans in 1390.\nIn 1647, Duart Castle was attacked and laid siege to by the Argyll government troops of Clan Campbell, but they were defeated and driven off by the Royalist troops of Clan MacLean.\nIn September 1653, a Cromwellian task force of six ships anchored off the castle, but the Macleans had already fled to Tiree. A storm blew up on the 13 September and three ships were lost, including Swan. To the north of the castle is a Historic Marine Protected Area within which lie the remains of a wrecked 17th century warship, believed to be the Swan.[5]\nIn 1678, the 9th Earl of Argyll, Chief of Clan Campbell and son of the late Marquess of Argyll, successfully invaded the Clan MacLean lands on the Isle of Mull and Sir John Maclean, 4th Baronet, fled the castle and withdrew to Cairnbulg Castle, and afterward to Kintail under the protection of the 3rd Earl of Seaforth.[6]\nIn 1691, Duart Castle was surrendered by Sir John Maclean, 4th Baronet, to the 10th Earl of Argyll (who was later created, in 1701, the 1st Duke of Argyll).[1] The Campbell clan partially demolished the castle, and the stones from the walls were scattered. The 5th Laird of Torloisk used some of the stones to build a cottage for his family close to the site of the castle.[7]\nBy 1751 the remains of the castle were abandoned.[8]\nDescendants of the 1st Duke of Argyll sold the castle in 1801, to MacQuarrie, who then sold it to Carter-Campbell of Possil who kept it as a ruin within the grounds of his own estate to the north, Torosay Castle. He later sold his Torosay Estate, which now included the ruins of Castle Duart, to A. C. Guthrie in 1865. On 11 September 1911, the ruin was separated from the rest of the Torosay Estate and was bought by Sir Fitzroy Donald Maclean, the 26th Chief of the Clan MacLean, and restored.[1][9][10]\nBy 2012, additional restorations were required and a fund was set up to accept donations for this purpose. Phase 7 of the project was underway in 2020.[11]\nLairds of Duart\nLairds are owners of an estate.\nLachlan Lubanach Maclean, 5th Chief, 1st laird of Duart, it was part of his wife's dowry.[4]\nRed Hector of the Battles Maclean, 6th Chief, 2nd laird of Duart.\nLachlan Bronneach Maclean, 7th Chief, 3rd laird of Duart.\nLachlan Og Maclean, 8th Chief, 4th laird of Duart.\nHector Odhar Maclean, 9th Chief, 5th laird of Duart.\nLachlan Maclean, 10th Chief, 6th laird of Duart.\nLachlan Cattanach Maclean, 11th Chief, 7th laird of Duart.\nHector Mor Maclean, 12th Chief (1497–1568), 8th laird of Duart.\nHector Og Maclean, 13th Chief, 9th laird of Duart.\nLachlan Mor Maclean, 14th Chief, 10th laird of Duart.\nSir Hector Og Maclean, 15th Chief, 11th laird of Duart.\n...\nSir John Maclean, 4th Baronet, 16th Laird of Duart. He surrendered Duart Castle in 1691 to The 10th Earl of Argyll, who demolished the castle. Sir John Maclean became the last laird of Duart until the restoration of the castle by Sir Fitzroy Donald Maclean over 221 years later.[1]\n2014 restoration\nIn 2012, the centenary of the 1912 restoration, the Chief of Clan Maclean announced that his family could no longer afford the upkeep of the castle in light of the expense of major repairs. In the winter of 2013–14 the castle lost four ceilings, which were brought down by water penetration through the chimneys. In July 2014, a restoration appeal was launched.[12]\nFilm location\nThe castle was used as a location in the 1945 film I Know Where I'm Going! (as \"Castle of Sorne\"). It was also featured in the 1971 film When Eight Bells Toll, starring Anthony Hopkins and in the 1999 film Entrapment, starring Sean Connery (who has MacLean ancestry on his mother's side) and Catherine Zeta-Jones.\nIt is also the setting for the base of Buffy Summers in the first half of Buffy the Vampire Slayer Season Eight.[citation needed]\nLighthouse\nTo the south east of the castle is the Duart Point lighthouse. The lighthouse was built in 1900, as a memorial to Scottish novelist William Black.[13][14][15]\nReferences\nExternal links\nWikimedia Commons has media related to Duart Castle.\nOfficial website\nDark Isle Photos Archived 8 March 2005 at the Wayback Machine\n360° image outside the castle\nHistory of Duart Castle\n56°27′21.9″N 5°39′17.8″W / 56.456083°N 5.654944°W / 56.456083; -5.654944\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.456083",
      "lon": "-5.654944"
    }
  },
  {
    "name": "Dunaverty Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Dunaverty_Castle",
    "text": "\"Dunaverty\" redirects here. For heritage-listed house in Brisbane, Australia, see Dunaverty, Albion.\nHistoric site\nDunaverty Castle is located at Southend at the southern end of the Kintyre peninsula in western Scotland. The site was once a fort belonging to the Clan Donald (MacDonald). Little remains of the castle,[1] although the site is protected as a scheduled monument.[2]\nHistory\nThe remains of Dunaverty Castle stand on a rocky head land on the south east corner of Kintyre, Scotland. The headland it was built on forms a natural stronghold with the sea on three sides and is only approachable from the north. It is attached to the mainland only by a narrow path. It is known that the castle itself was accessed by a drawbridge.\n13th century\nIn 1248, Henry III, King of England allowed Walter Byset to buy stores from Ireland for Dunaverty Castle which he had seized and was fortifying, apparently in revenge for hospitality given by Alexander II, King of Scotland to certain English pirates. However during that same year the castle was taken by Allan, the son of the Earl of Atholl, and Byset was taken prisoner.\nIn 1263, Dunaverty Castle was garrisoned by Alexander III, King of Scotland during the Norwegian campaign of Hákon Hákonarson, King of Norway.\nThe castle was eventually surrendered to the Norwegian king, who in turn granted it to Dubhghall mac Ruaidhrí, one of his steadfast supporters in the Hebrides. With the evaporation of Norwegian sovereignty in the Hebrides after 1263, Alexander III appears to have retaken the castle.[3]\n14th century\nLate in 1306, the embattled Robert I, King of Scotland seems to have fled to the safety of Dunaverty Castle and his friend, Aonghus Óg Mac Domhnaill, the Lord of the Isles. According to The Bruce, the king was harboured there for three days by Aonghus Óg Mac Domhnaill, before Aonghus took him to Rathlin Island. Some contemporary sources suggest that the castle was already under the king's control, however, and that the king acquired it from a certain Maol Coluim in March. In September of that year, when the English arrived at the castle, the Scottish king was not to be found.\n15th century\nIn 1493 the fourth and last Lord of the Isles forfeited his title to James IV, King of Scotland. By 1494 the king had garrisoned and provisioned Dunaverty Castle. It is said that the MacDonalds, led by Sir John MacDonald whom the king had recently knighted, retook the castle before the King had even departed to Stirling and that the dead body of the King's castle governor was hung over the castle walls in sight of the King and his departing entourage. Sir John Macdonald however was later captured by MacIain of Ardnamurchan. He was tried and hanged on the Burgh Muir near Edinburgh.\n16th century\nThe castle was repaired by the crown between 1539 and 1542. In January 1544, a Commission in Queen Mary's name was given to the captain, constable and keeper of the Castle of Dunaverty, to deliver it with its artillery and ammunition to the Earl of Argyll and in April of that year Argyll received a 12-year tack of North and South Kintyre, including the castle.\nThe English raided Kintyre and Campbeltown Loch in October 1588 because of the activities of the Clan MacDonald in Ireland. The Earl of Sussex sailed from Dublin in the Mary Willoughby with a small fleet and burnt Saddell, Dunaverty and Machrimore. He then burnt farms on Arran, Bute, and Cumbrae.[4]\n17th century\nIn 1626, the Lordship of Kintyre was reconstituted in favour of the Earl of Argyll and Dunaverty Castle was denoted as its principal messuage. Argyll bestowed the Lordship of Kintyre on James, his eldest son by his second marriage, who, in 1635, at Dunaverty, granted a charter of the Lordship to Viscount Dunluce, eldest son of Randal MacDonnell, 1st Earl of Antrim. The transfer was set aside by the Scottish Privy Council, no doubt on a complaint by Argyll's eldest son, the Marquis of Lorn, who had bitterly resented his father's bestowal of the Lordship on his younger half-brother. On 12 December 1636, Lorn received a charter, under the Great Seal, of the Lordship of Kintyre, with the Castle of Dunaverty as its principal messuage.\nDuring the Civil War Dunaverty was besieged in 1647 by Scottish supporters of Oliver Cromwell who were led by General David Leslie (Leslie later became a Royalist). The MacDonalds surrendered and then 300 of them were massacred. This incident became known as the Battle of Dunaverty, or \"Dunaverty Massacre\". The castle is nothing more than a ruin now, known as Blood Rock for the massacre which took place there.\nSee also\nScottish castles\nCitations\nReferences\nBarrow, GWS (1981). Kingship and Unity: Scotland 1000–1306. Toronto: University of Toronto Press. ISBN 0 8020 6448 5.\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1000,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "55.3075",
      "lon": "-5.6447"
    }
  },
  {
    "name": "Dunollie Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Dunollie_Castle",
    "text": "Small ruined castle on the west coast of Scotland in Argyll and Bute\nDunollie Castle (Scottish Gaelic: Caisteal Dhùn Ollaigh) is a small ruined castle located on a hill north of the town of Oban, on the west coast of Scotland in Argyll and Bute. The site enjoys views over towards the island of Kerrera and a view of the town, harbour, and outlying isles. The castle is open to the public as part of the Dunollie Museum, Castle and Grounds.\nHistory\nThere was a fortification on this high promontory in the early Middle Ages, when Dunollie was the royal centre of the Cenél Loairn within the kingdom of Dál Riata. The Irish annals record that \"Dun Ollaigh\" was attacked or burned down three times, in 686, 698, and in 701.[1] It was subsequently rebuilt in 714 by Selbach mac Ferchair (died 730), the King of Dál Riata credited with destroying the site in 701.[1][2] Excavations in the 1970s suggest that this early fortification was abandoned some time in the 10th century.[3]\nThe area around Dunollie subsequently became part of the semi-independent Kingdom of the Isles, ruled over by Somerled in the 12th century. On his death the MacDougalls became Lords of Lorne.[2] Dougall, Somerled's son, held most of Argyll and also the islands of Mull, Lismore, Jura, Tiree, Coll and many others in the 12th century.\nExcavations show that Dunollie was refortified with an earthwork castle in the 13th century or potentially the late 12th century. The builder may have been Dougall, or his son Duncan.[4] Ewan MacDougall, great-grandson of Somerled and the third chief of the MacDougalls, switched the clan's allegiance in the mid 13th century: initially allied with Haakon IV of Norway, from the 1250s Ewan remained loyal to the kings of Scotland.\nIn the 14th century Ewan's grandson John MacDougall, along with his kinsmen the Comyns, sided with the Balliols against the interests of Robert the Bruce. John MacDougall's army defeated the Bruce at the Battle of Dalrigh in 1306, but Bruce returned in 1308 and crushed the MacDougalls at the Battle of the Pass of Brander. The MacDougall lands of Lorne were subsequently forfeit and were given to the Campbells, though Dunollie and other estates were regained later in the 14th century.\nDunollie Castle - painting by Sir George Reid\nThe existing castle ruins date largely from the 15th century.[5]\nThe Marquis of Argyll captured the castle in 1644, but it was returned to the MacDougalls in 1661. In 1746, the MacDougalls abandoned Dunollie Castle and built Dunollie House just downhill from the castle ruins.\nIn recent years, a charitable trust was formed titled The MacDougall of Dunollie Preservation Trust, who are responsible for the care of the historic buildings and collections held in this an ancestral site. Today, the Dunollie Preservation Trust operates Dunollie Museum, Castle & Grounds - a visitor attractions and social enterprise. Through the running of this organisation, all funds raised contribute to ongoing conservation and development efforts as well as education and learning.[6] Remains of a historical herb garden have recently been discovered in the castle grounds.\nGallery Dunollie Castle Oban, Dunollie Castle Dunollie Castle - May 2016\nSee also\nRoyalist rising of 1651 to 1654\nDunstaffnage Castle\nReferences\nSources\nAlcock, Leslie; Alcock, Elizabeth A (1987). \"Reconnaissance excavations on early historic fortifications and other royal sites in Scotland, 1974-84: 2, Excavations at Dunollie Castle, Oban, Argyll, 1978\" (PDF). Proceedings of the Society of Antiquaries of Scotland. 117: 119–147.\nExternal links\nMap sources for Dunollie Castle\nWikimedia Commons has media related to Dunollie Castle.\nOfficial Website\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "12th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.42639",
      "lon": "-5.48472"
    }
  },
  {
    "name": "Dunoon Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Dunoon_Castle",
    "text": "Castle in Argyll and Bute, Scotland\nDunoon Castle is a ruined castle in Dunoon, Argyll and Bute, Scotland. The castle sat upon a cone-shaped hill about 80 feet (24 m) high. Very little remains of the castle's structure today. Castle House, built in 1822, stands a few yards north of the castle ruins.[1]\nThe remains of the castle, and a surrounding area, are a scheduled monument.[2][3]\nThe castle was a royal residence in the 14th century, and in the 17th century fell into ruins.[4]\n13th–15th century\nDunoon Castle engraving by William Miller after W Brown\nDunoon Castle Entrance\nThe castle is first recorded in the thirteenth century.[5] It may have been constructed in the context of the Stewarts increasing authority in Cowal.[6]\nIn 1333 Dunoon Castle was besieged and taken by Edward Balliol, who surrendered it to Edward III of England.[7] An insurrection ensued, driving Baliol out of Scotland. Robert the Steward, later King Robert II of Scotland, arrived in Cowal and, with the help of Colin Campbell of Lochow, retook the castle.[8]\nJames III undertook to repay his Master of Household, Colin Campbell, 1st Earl of Argyll for repairs to the castle in 1468, and made him keeper of the castle in 1472.[9] By the 15th century it was a royal castle with the Campbells as hereditary keepers.[5]\n16th century\nIn 1544 Dunoon Castle was besieged by Matthew Stewart, 4th Earl of Lennox. Having eighteen ships and 800 soldiers provided by Henry VIII of England, Lennox succeeded in taking the Castles of Dunoon and Rothesay. Archibald Campbell, 4th Earl of Argyll, was driven out, sustaining great loss.[10]\nIn 1563, Mary, Queen of Scots, stayed at the castle while visiting her half-sister, Jean Stewart, Countess of Argyll, and granted several charters during her visit.[11] Mary's rebels met up at Dunoon during the Chaseabout Raid. Her brother the Earl of Moray's faction in Argyll included the Duke of Châtelherault, and the Earls of Argyll and Rothes. They left for Ayrshire on 18 August 1565.[12]\n17th century\nIn 1646 occurred the Dunoon massacre in which the Campbells slaughtered men, women, children, and infants of Clan Lamont.[13] After the restoration of the episcopacy under Charles II, Dunoon became the residence of the bishops of Argyll for a time.[14]\nThe castle was destroyed during the Earl of Argyll's rebellion against James VII and II in 1685.\n20th century\nDuring World War I and II, military fortifications were established at Dunoon Castle for the defense of the River Clyde and the shipbuilding industry.[15]\nReferences\nExternal links\nMap sources for Dunoon Castle\nVisit Scotland webpage for Dunoon Castle\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": null,
      "pre1291Found": false,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "55.945599",
      "lon": "-4.9238077"
    }
  },
  {
    "name": "Dunstaffnage Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Dunstaffnage_Castle",
    "text": "Castle in Argyll and Bute, Scotland, UK\nDunstaffnage Castle (Scottish Gaelic: Caisteal Dhùn Stadhainis) is a partially ruined castle in Argyll and Bute, western Scotland. It lies 3 miles (5 km) NNE of Oban, situated on a platform of conglomerate rock on a promontory at the south-west of the entrance to Loch Etive, and is surrounded on three sides by the sea.[1] The castle and the nearby chapel ruin have been a Historic Scotland property since 1958.[2] Both are Scheduled Ancient Monuments.[3][4]\nThe castle dates back to the 13th century, making it one of Scotland's oldest stone castles, in a local group which includes Castle Sween and Castle Tioram.[5] Guarding a strategic location, it was built by the MacDougall lords of Lorn, and has been held since the 15th century by the Clan Campbell. To this day there is a hereditary Captain of Dunstaffnage, although they no longer reside at the castle. Dunstaffnage is maintained by Historic Environment Scotland, and is open to the public, although the 16th century gatehouse is retained as the private property of the Captain. The prefix dun in the name means \"fort\" in Gaelic, while the rest of the name derives from Norse stafr-nis, \"headland of the staff\".\nHistory\nBefore Dunstaffnage\nBefore the construction of the castle, Dunstaffnage may have been the location of a Dál Riatan stronghold, known as Dun Monaidh, as early as the 7th century.[6] It was recorded, by John Monipennie in 1612, that the Stone of Destiny was kept here after being brought from Ireland, and before it was moved to Scone Palace in 843. However, Iona and Dunadd are considered more likely, given their known connections with Dál Riatan and Strathclyde kings.[7] Hector Boece records that the stone was kept at \"Evonium\", which has traditionally been identified with Dunstaffnage, although in 2010 the writer A. J. Morton identified Evonium with Irvine in Ayrshire.[8]\nThe MacDougalls\nThere was a castle here in the time of Somerled, Lord of the Isles.[9] However, the castle became the seat of Duncan MacDougall, Lord of Lorn and grandson of Somerled in the second quarter of the 13th century.[10] He had also travelled to Rome in 1237 and was the founder of nearby Ardchattan Priory.[11] Duncan's son Ewen MacDougall inherited his father's title in the 1240s, and expanded the MacDougall influence, styling himself \"King of the Isles\" though that title belonged to the MacDonalds. It is probable that Ewen built the three round towers onto the castle, and constructed and enlarged the hall inside.[12]\nFollowing Alexander III's repulse of the Norse influence in Argyll, the MacDougalls backed the Scottish monarchy, and Ewen's son Alexander was made the first sheriff of Argyll in 1293. However, they supported the Balliol side during the Wars of Scottish Independence which broke out a few years later. Robert Bruce defeated the Clan MacDougall at the Battle of the Pass of Brander in August 1308. After a brief siege, King Robert took control of the MacDougall castle of Dunstaffnage.[13] He did not destroy it, as he did others, but appointed a constable and provisioned it, thinking to use it to guard the countryside and seaways. With the land he gave his friend, Angus Og Macdonald, Lord of the Isles, that included much of the MacDougall lands, including nearby Mull, the castle could be well used for that purpose by the Isleman.\nRoyal fortress\nNow a Crown property, Dunstaffnage was controlled by a series of keepers. James I seized the castle in 1431, following the Battle of Inverlochy, as his enemies were hiding inside. In 1455 James Douglas, 9th Earl of Douglas stayed at Dunstaffnage, on his way to treat with John MacDonald, Lord of the Isles.[14] This followed James II's attack on Douglas power, and led to the signing of the Treaty of Westminster-Ardtornish. A later keeper, John Stewart of Lorn, was a rival of Alan MacDougall, and was stabbed by his supporters on his way to his marriage at Dunstaffnage Chapel in 1463, although he survived long enough to make his vows. Although MacDougall took the castle, he was ousted by James III, who granted Dunstaffnage to Colin Campbell, 1st Earl of Argyll in 1470.[15]\nThe south facade of Dunstaffnage Castle\nClan Campbell\nThe Earls of Argyll appointed Captains to oversee Dunstaffnage, and keep it in readiness, on their behalf. Changes were made to the buildings, particularly the gatehouse, which was rebuilt around this time. The Campbells were loyal allies of the royal house, and Dunstaffnage was used as a base for government expeditions against the MacDonald Lords of the Isles, among others, during the 15th and 16th centuries. James IV visited Dunstaffnage on two occasions.[14]\nDunstaffnage saw action during the Civil War, holding out against Montrose's army in 1644. The castle was burned by royalist troops, following the failure of Argyll's Rising in 1685, against the Catholic James VII.[16] During the Jacobite risings of 1715 and 1745, the castle was occupied by government troops. Flora MacDonald, who helped Bonnie Prince Charlie to escape from Scotland, was briefly imprisoned here while en route to imprisonment in London.[14]\nAccording to W. Douglas Simpson the castle appears in Tobias Smollet's Humphry Clinker, which although not naming Dunstaffnage, presents \"a fair picture of life in the castle in the third quarter of the eighteenth century\".[17]\nDecline and restoration\nThe Campbells continued to add to the castle, building a new house over the old west range in 1725. However, the rest of the castle was already decaying. In 1810 an accidental fire gutted the gatehouse, and the Captains ceased to live here, moving to Dunstaffnage House some 2 km to the south-east.[14] Tenants lived in the 1725 house within the castle until 1888.[18]\nRestoration work was undertaken in 1903 by the Duke of Argyll, the castle's owner. This was followed in 1912 by a court case, in which the Court of Session ruled that Angus Campbell, the 20th hereditary Captain, had right of residence notwithstanding the Duke of Argyll's ownership. Works were delayed by World War I, and the planned total restoration was never completed.[19] In 1958, the 21st Captain and the Duke agreed to hand the castle into state care,[18] and it is now open to the public as a Historic Environment Scotland property.[3][4]\nDescription\nPlans of Dunstaffnage Castle\nWalls\nDunstaffnage is an irregular quadrangular structure of great strength, with rounded towers at three of the angles. It measures approximately 35 by 30 metres (115 by 98 ft), and has a circumference of about 120 metres (390 ft). The walls are of coursed rubble, with sandstone dressings, and stand up to 18 m (60 ft) high, including the conglomerate bedrock platform. The walls are up to 3 m (10 ft) thick, affording strong defence to this highly strategic location, guarding the entrance to Loch Etive and the Pass of Brander beyond, and today commanding a splendid view. The parapet walk, which once followed the whole of the walls, has been partially restored with new stone flags. The original parapet is now also gone. Arrow slits, later converted into gunloops, are the only openings. Brass cannon recovered from wrecked vessels of the Spanish Armada were once mounted on the walls.[1]\nRound towers\nSoon after the construction of the castle walls, three round towers were built on the north, east, and west towers. The north tower, or donjon, is the largest, comprising three or four storeys originally, and probably housed the lord's private apartments.[20] The west tower is almost internal, barely projecting beyond the rounded corner of the curtain wall, and could only be entered via the parapet walk. The basement level contains a pit prison which was accessed from above. The east tower was almost completely rebuilt in the late 15th century as a gatehouse. Each tower was probably once topped by a conical roof.[21]\nThe gatehouse, with the remains of the north-east hall range to the left\nThe gatehouse\nThe gatehouse was built by the Campbells in the late 15th century, replacing an earlier round tower in the east corner. It takes the form of a four-storey harled tower house, with the entrance passage running through half the vaulted basement, the other half forming guard rooms with arrow slits facing the gate. The present approach to the gate is by a stone stair, replacing an earlier drawbridge.[22] The tower was remodelled in the 18th century to provide reception rooms and a private suite. The dormer windows at the top are capped by the pediments from the 1725 house (see below), and bear the date, the Campbell arms, and the initials AEC and DLC, for Aeneas Campbell, 11th Captain, and his wife Dame Lilias. The pediments were moved here during the 1903 restoration works.[23]\nInternal ranges\nThe north-west range of 1725, with the gatehouse on the right, seen from the parapet walk\nThe east range was located between the north and east towers, although only foundations remain. This was the principal range of buildings and contained a large hall above vaulted cellars.[24] The hall had double-lancet windows, decorated with carved patterns, which were later blocked up; their outlines can be seen in the east curtain wall.\nA second range stood along the north-west wall, and would have been connected to the hall range by the donjon tower. The ground floor housed a kitchen. In 1725 the range was remodelled into a two-storey house, accessed via a stone stair, and topped with the dormer windows which now form part of the gatehouse. The well in front is original, although the large stone surround is of 19th century date.[25]\nEast end of Dunstaffnage Chapel, showing the lancet windows and the Campbell burial aisle beyond\nDunstaffnage Chapel\nA ruined chapel lies around 150 metres (490 ft) to the south-west of the castle. This was also built by Duncan MacDougall of Lorn, as a private chapel, and features detailed stonework of outstanding quality. Experts believe that the chapel was built in the second quarter of the 13th century. The chapel is 20 by 6 metres (66 by 20 ft), and formerly had a timber roof. The lancet windows carry dog-tooth carving, and have fine wide-splayed arches internally. The chapel was already ruinous in 1740, when a burial aisle was built on to the east end, to serve as a resting place for the Campbells of Dunstaffnage.[26][27]\nCaptain of Dunstaffnage\nTraditionally, an officer called the Hereditary Captain of Dunstaffnage is responsible for the castle and its defence. The office still exists, and to retain the title (now rather a sinecure without military significance), the incumbent is required to spend three nights a year in the castle. No other responsibilities or privileges now attach to the post.\nCastle ghost\nA ghost, known as the \"Ell-maid of Dunstaffnage\", is said to haunt the castle. A type of gruagach, the ghost's appearances are said to be associated with events in the lives of the hereditary keepers.[14]\nNotes\nDunstaffnage Castle, 1836 engraving by William Miller after J. M. W. Turner\nReferences\nCoventry, Martin. The Castles of Scotland (3rd Edition), Goblinshead, 2001\nGrove, Doreen. Dunstaffnage Castle & Chapel, Historic Scotland, 2004\nLindsay, Maurice. The Castles of Scotland, Constable & Co. 1986\nHistoric Environment Scotland. \"Dunstaffnage Castle (SM90120)\". Retrieved 25 February 2019.\nHistoric Environment Scotland. \"Dunstaffnage Castle Chapel (SM90121)\". Retrieved 25 February 2019.\nSimpson, W. Douglas. Dunstaffnage Castle and the Stone of Destiny, Oliver and Boyd, 1958\nTabraham, Chris. Scotland's Castles, BT Batsford/Historic Scotland, 1997\nWalker, Frank Arneil. The Buildings of Scotland: Argyll and Bute, Penguin, 2000\n\"Dunstaffnage Castle\". Canmore. Historic Environment Scotland. Retrieved 19 January 2018.\n\"Dunstaffnage Chapel\". Canmore. Historic Environment Scotland. Retrieved 19 January 2018.\nExternal links\nWikimedia Commons has media related to Dunstaffnage Castle.\nDunstaffnage Castle – site information from Historic Environment Scotland\nTake a 360° Virtual Tour of Dunstaffnage Castle grounds Archived 27 September 2021 at the Wayback Machine\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1237,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.454653",
      "lon": "-5.436936"
    }
  },
  {
    "name": "Duntrune Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Duntrune_Castle",
    "text": "Historic site\nDuntrune Castle is located on the north side of Loch Crinan and across from the village of Crinan in Argyll and Bute, west of Scotland. It is thought to be the oldest continuously occupied castle on mainland Scotland.[1] It was the seat of the Campbells of Duntroon until 1792. The castle is a category B listed building.[2]\nHistory\nIt was originally built by the MacDougall clan in the 13th century, along with several other castles in the area, including the MacDougall stronghold of Dunollie Castle near Oban. Duntrune Castle was eventually taken by the Clan Campbell, becoming the seat of the Campbells of Duntroon. In the 17th century the castle was besieged by the rival MacDonalds, under Alasdair Mac Colla.[3] The Campbells sold Duntrune in 1792, to the Malcolms of Poltalloch. The castle is now owned by Robin Neill Malcolm, current clan chief of the Clan Malcolm.[4]\nThe curtain wall of the castle dates from the 13th century, although the tower house which forms the main part of the castle is of the 17th century.[3] The castle was renovated in 1954.[2]\nPopular culture\nThe gateposts of Skyfall lodge, James Bond's childhood home in the film of the same name, were modelled after those at Duntrune.[5]\nA photograph of Duntrune Castle is part of the original album inner sleeve art of the Blue Öyster Cult album Imaginos.[citation needed]\nSee also\nDuntroon, Australian Capital Territory, a location named after the castle\nRobert Campbell (1769–1846), descended from the Campbells of Duntroon\nReferences\nExternal links\nGazetteer for Scotland\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.10196",
      "lon": "-5.549273"
    }
  },
  {
    "name": "Dunyvaig Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Dunyvaig_Castle",
    "text": "Castle in Argyll and Bute, Scotland, UK\nRuins of Dunyvaig Castle\nDunyvaig Castle (Scottish Gaelic: Dùn Naomhaig, Anglicised Fort of the galleys, also known as Dunnyveg)[1] is located on the south side of Islay, in Argyll, Scotland, on the shore of Lagavulin Bay, 4 kilometres (2+1⁄2 miles) from Port Ellen.[1] The castle was once a naval base of the Lord of the Isles, chiefs of Clan Donald. It was held by the chiefs of the Clan MacDonald of Dunnyveg.\nHistory\n12th century\nA castle was built by Somerled, King of the Isles, on top of a fort or dun on a rocky promontory jutting into Lagavulin Bay.\n13th and 14th centuries\nThe castle was held by the Macdonalds, Lords of the Isles, Somerled's descendants, specifically, Angus Mor Macdonald and his sons, Alexander Og and Angus Og. They used Lagavulin Bay as an anchorage for their fleet of galleys.\n15th and 16th centuries\nForfeited in 1493, the castle passed to the MacIans of Ardnamurchan.[2] The MacIans were descended from John Macdonald, younger brother of Angus Og Macdonald, Lord of the Isles and friend of Robert the Bruce, and suffered when that clan was punished for the 1501-1506 insurrection of Black Donald; the castle was transferred to a branch of the Campbells. In 1545, however, the MacDonald holdings in Islay and Jura were restored to them.[2]\nMary, Queen of Scots planned a visit to Argyll in June 1563. Agnes Campbell, the wife of James MacDonald of Dunyvaig, gave the queen a \"marvellous fair\" costume of \"Hyeland apparell\".[3] In 1598 the castle was kept by John Stewart of Arskok who was given £3000 Scots yearly for the expenses.[4]\n17th century\nAngus MacDonald, 8th of Dunnyveg surrendered the castle by negotiation to the king's lieutenant Andrew Stuart, 3rd Lord Ochiltree and the Bishop of the Isles Andrew Knox who brought a royal naval force with 1000 men on 2 August 1608. On 5 August Angus MacDonald and others came aboard the Advantage to celebrate Gowrie day, the anniversary of the rescue of James VI of Scotland at Perth in 1600. A garrison loyal to the king was installed.[5]\nIn 1614, the castle was taken by Ranald Og Macdonald, however it was retaken by Angus Og MacDonald, who attempted to bargain the castle's surrender. Knox attempted to retake the castle in September 1614 and was defeated and compelled to retreat. Knox left his son Thomas and his nephew John Knox of Ranfurly as hostages for his good faith.\nKnox wrote to the lawyer Thomas Hamilton explaining these events and his actions after accusations that his inaction and sloth had led to the capture of the castle by the MacDonalds. He said his negotiation for the castle's surrender had stalled, and he had found it difficult to hire boats to take him from Arran to Dunyvaig during the harvest time. The MacLeans and McLeods of Harris refused to serve with him, and he could raise no more than seventy men, of whom fifty were waged soldiers and twenty followers of the lairds of Ardincaple and Ranfurly. When he landed on Islay, lacking any further armed support, the Clan Donald of Islay, outmanoeuvred him and cut him off from his boats, which they looted and destroyed. The next day Knox was told he should surrender the two hostages or all his men would be executed. Knox noted that the MacDonalds had built a new fort in the loch. Some of his men had heard Angus Og MacDonald say he was working for the Earl of Argyll, who would give him the castle and the whole lands of Islay.[6] Thomas Hamilton wrote to Knox, who was at Brodick Castle offering the services of the Earl of Caithness and his cannon, but noting it was too late in the year.[7]\nGeorge Graham negotiated the freedom of the two hostages or \"gentlemen prisoners\" although he lacked official support except a verbal promise from the Chancellor, Alexander Seton, 1st Earl of Dunfermline of a cash reward.[8] On 6 January 1615, Sir John Campbell of Calder, with the assistance of Sir Oliver Lambart who brought artillery and men in the Phoenix and retook the castle.[9] Lambert captured 22 men while 22 others including Coll Ciotach escaped from a postern gate into a longboat.[10]\nIn June 1615 Sir James MacDonald and Coll Ciotach captured the castle again, killing the captain and some of the garrison. The Privy Council of Scotland asked for a pinnace with cannon to batter the castle. Sir James MacDonald fled, and on 13 October 1615 before the guns were landed from the Charles and a barque Coll Ciotach surrendered to Argyll.[11]\nThe castle was seized in 1647 by the Covenanters and passed into the hands of the Campbells of Cawdor, who held it until 1677, when Sir Hugh Campbell pulled down the castle and moved to Islay House.[2]\nRuins\nToday all that remains of the castle are mainly the ruins of the sixteenth-century castle, although the site includes a thirteenth-century courtyard, and a fifteenth-century keep.[2] The site was designated as a scheduled monument in 1989.[12]\nReferences\nExternal links\nWikimedia Commons has media related to Dunyvaig Castle.\nhttps://web.archive.org/web/20070622063122/http://www.highlandconnection.org/castles/dunnyvegcastle.html\n55°38′01″N 6°07′23″W / 55.63361°N 6.12306°W / 55.63361; -6.12306\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1000,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "55.63361",
      "lon": "-6.12306"
    }
  },
  {
    "name": "Fincharn Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Fincharn_Castle",
    "text": "Fincharn Castle, also known as Fionchairn Castle and Glassery Castle, is a ruined castle near Ford on the southwest shore of Loch Awe, Scotland.\nThe castle was probably built in about 1240, the year the lands of Fincharn were granted to Giolla Easbaig Mac Giolla Chríost by Alexander II, King of Scotland.[1]\nThe castle seems to be identical one mentioned in correspondence between Alasdair Óg Mac Domhnaill and Edward I, King of England in 1297. According to this correspondence, Alasdair Óg seized control of the barony and castle of \"Glasrog\" from the Steward of Scotland on account of the steward's disloyalty to the English king.[2]\nThe castle may have been one of the three mentioned in correspondence between Eóin Mac Dubhghaill and Edward I in 1308 or 1309. According to this correspondence, Eóin garrisoned these castle on behalf of the English king.[3]\nIt is a scheduled ancient monument.[4]\nReferences\n\"Fincharn Castle\". CANMORE. Retrieved 3 July 2010.\n\"Fincharn Castle SM5276\". Historic Environment Scotland. Retrieved 5 September 2017.\nArgyll: An Inventory of the Monuments. Vol. 7, Mid Argyll & Cowal. The Royal Commission on the Ancient and Historical Monuments of Scotland. 1992. ISBN 0 11 494094 0 – via ScotlandsPlaces.\n56°11′10.21″N 5°23′17″W / 56.1861694°N 5.38806°W / 56.1861694; -5.38806\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1240,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.1861694",
      "lon": "-5.38806"
    }
  },
  {
    "name": "Innes Chonnel Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Innes_Chonnel_Castle",
    "text": "Innes Chonnel Castle or Ardchonnel Castle is a ruined 13th-century castle on Innis Chonnell, an island on Loch Awe near Dalavich, Argyll and Bute, Scotland. The fortress was once a stronghold of Clan Campbell.\nThe castle and the island are jointly a designated scheduled monument.[1]\nHistory\nThe castle that stands on the wooded island of Innis Chonnell has thick outer walls.[2] It was the original stronghold of the Clan Campbell from possibly the eleventh century or earlier.[2] It was the seat of Cailean Mór (Sir Colin Campbell) who was killed fighting the Clan MacDougall at the Battle of Red Ford in 1296.[2] Later John MacDougall held the castle against Robert the Bruce in 1308.[2] Sir Colin Campbell's son, Sir Neil Campbell, married Bruce's sister, Mary, and Sir Neil fought for the Bruce at the Battle of Bannockburn in 1314.[2] Innis Chonnel Castle was abandoned by the Campbells as their residence in the fifteenth century, but it was still used as a prison.[2] The young Domhnall Dubh (\"Black Donald\"), son of Aonghas Óg (Angus) and heir to the Lordship of the Isles, was imprisoned in the castle after the Battle of Bloody Bay, which took place off the coast of the Isle of Mull in 1484.[2] He escaped but after invading Badenoch in 1503 he was recaptured and imprisoned in Edinburgh Castle for forty years.[2] Innis Chonnell Castle was in ruins by the nineteenth century.[2]\nReferences\nExternal links\nRoyal Commission on the Ancient and Historical Monuments of Scotland listing - Innes Chonnel Castle Archived 19 October 2012 at the Wayback Machine, CANMORE\n56°15′24″N 5°16′03″W / 56.2568°N 5.2675°W / 56.2568; -5.2675\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "56.2568",
      "lon": "-5.2675"
    }
  },
  {
    "name": "Rothesay Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Rothesay_Castle",
    "text": "Castle in Argyll and Bute, Scotland, UK\nRothesay Castle is a ruined castle in Rothesay, the principal town on the Isle of Bute, in western Scotland. Located at NS086646, the castle has been described as \"one of the most remarkable in Scotland\",[1] for its long history dating back to the beginning of the 13th century, and its unusual circular plan.\nThe castle comprises a huge curtain wall, strengthened by four round towers, together with a 16th-century forework, the whole surrounded by a broad moat. Built by the Stewart family, it survived Norse attacks to become a royal residence. Though falling into ruin after the 17th century, the castle was repaired by the Marquess of Bute before passing into state care in the 20th century.\nA paddle steamer named after the castle was constructed in 1816.\nThe early castle\nThe castle was built either by Alan fitz Walter, Steward of Scotland (died 1204), or by his succeeding son Walter (died 1246). During Alan's tenure, the family added the Isle of Bute to their lordship.[2] A wooden castle was constructed first, but the stone circular curtain wall was in place by the 1230s, when the castle was attacked and taken by the Norwegian-backed fleet of Óspakr-Hákon, King of the Isles (died 1230). According to Hákonar saga Hákonarsonar, Óspakr's forces fought for three days to take the castle, breaking down part of the eastern wall by hewing the stone with their axes. This saga is the earliest recorded account of an assault on a Scottish castle.[3] In 1263, Rothesay was taken again by the Norwegian forces under Hákon Hákonarson, King of Norway (died 1263) before the Battle of Largs. Although the Battle of Largs is called indecisive, Hákon's campaign was a failure, the Norse retreated, and it effectively ended Norwegian authority in western Scotland.\nThe early castle comprised only the roughly circular curtain wall, 2.7 m (9 ft) thick, 7.9 m (26 ft) high and around 42 m (138 ft) in diameter, built on a low mound, with a battlement on top accessed by open stairs.[4][5] The moat was connected to the sea, the shoreline then being closer to the north-east of the Castle than it is today. The broad crenellations can be made out within the walls, which were later raised. Holes in the upper wall would have supported a timber bretasche, a projecting structure serving as an extended battlement. This curtain wall was built of coursed ashlar, and had only two openings in its length. The main gate was an arched opening with a simple timber door. The second opening was a small postern gate in the west wall, later blocked.\nIn the later part of the 13th century, the castle was strengthened by the addition of four round towers, of which only the north-west survives intact. These three-storey towers had strong splayed bases, with arrow slits below the crenellated parapet. A portcullis was added to the main gate.\nWars of independence and the rise of the Stewarts\nDuring the Wars of Scottish Independence, Rothesay was held by the English, but was taken by Robert the Bruce in 1311. It then returned to English hands in 1334, before being taken again by the Scots. Following the accession of the Stewarts to the throne of Scotland in 1371, the castle became a favourite residence of kings Robert II and Robert III, who died here in 1406. Robert II granted the hereditary keepership of the castle to his son John, ancestor of the Earls and Marquesses of Bute. Robert III made his eldest son David Duke of Rothesay in 1401, beginning a tradition of honouring the heir to the throne of Scotland with this title. In 1462 the castle survived a siege by the forces of John of Islay, Earl of Ross and the last Lord of the Isles.\n16th and 17th centuries\nIn the early 16th century Rothesay Castle was strengthened again. Construction of a gatehouse keep, extending from the north of the curtain wall, began around the turn of the century, to provide more modern accommodation for James IV. The curtain wall itself was raised up to ten metres in height, the works continuing into the reign of James V. In 1527 the castle withstood another siege by the Master of Ruthven, which destroyed much of the burgh of Rothesay. In 1544, the castle fell to the Earl of Lennox, acting for the English during the so-called \"Rough Wooing\".\nThe forework is an L-plan structure, which jutted into the moat and was accessed by a drawbridge. The lower floor comprised a vaulted entrance tunnel running into the older castle courtyard. Above, the four-storey tower contained royal lodgings, and still bears the royal coat of arms above the door. Also in the early 16th century, a chapel was constructed inside the old castle. Simple in form, the chapel measured around 7 m (23 ft) by 14 m (45 ft), and is now the only surviving structure within the curtain wall.[4] The north-west tower was converted into a doocot, and is known as the \"Pigeon Tower\", due to the nest boxes built into the outside wall.\nEsmé Stewart, 1st Duke of Lennox, a favourite of James VI was compelled by the Ruthven Regime to leave Scotland. He went first to Dumbarton Castle, then stayed at Rothesay Castle in October 1582.[6]\nRothesay was garrisoned for the occupying forces of Oliver Cromwell, who invaded Scotland with his New Model Army in the early 1650s. On their departure in 1660, the troops partially dismantled the structure. What was left was burned by the supporters of Archibald Campbell, 9th Earl of Argyll during his rising of 1685, in support of the Monmouth Rebellion against James VII.\nRepair and restoration\nThe vaulted entrance tunnel.\nFollowing a long period of neglect, the 2nd Marquess of Bute employed 70 men to excavate the ruins, clearing large amounts of rubbish from the castle in 1816–17. But it was not until the 1871 that work resumed and the ruins were stabilised.[7] The 3rd Marquess, a keen restorer of historic buildings, embarked upon a series of repairs and restorations, following surveys and advice from his regular architect William Burges. His \"restorations\" continued until 1900, and include the clearing and shaping of the moat, as well as the red sandstone additions to the forework, which reinstated the hall roof while significantly altering the character of the building.\nIn 1961 Rothesay Castle was given to the state, and is now a Scheduled Ancient Monument, in the care of Historic Environment Scotland.[8]\nThe castle is open to visitors year round. Fine views can be seen from the top of the walls over the town and back towards the mainland.\nNotes\n^ Lindsay (1986), p.412\n^ Barrow, Geoffrey Wallis Steuart (2004). \"Stewart family\". Oxford Dictionary of National Biography (online ed.). Oxford University Press. doi:10.1093/ref:odnb/49411. (Subscription or UK public library membership required.)\n^ Tabraham (2000), p.38\n^ a b \"Rothesay\". Gazetteer for Scotland. Gazetteer for Scotland. Retrieved 3 September 2017.\n^ \"Bute, Rothesay, Rothesay Castle\". Canmore. Historic Environment Scotland. Retrieved 3 September 2017.\n^ Bowes Correspondence (London, 1842), pp. 205, 211, 217.\n^ Scott (2018), p.29\n^ \"Rothesay Castle, castle 75m N of Bute MuseumSM12970\". Historic Environment Scotland. Retrieved 6 September 2017. References\nCoventry, Martin The Castles of Scotland (3rd Edition), Goblinshead, 2001\nLindsay, Maurice The Castles of Scotland, Constable & Co. 1986\nTabraham, Chris Scotland's Castles, BT Batsford/Historic Scotland, 1997\nWalker, Frank Arneil The Buildings of Scotland: Argyll and Bute, Penguin, 2000\nNational Monuments Record of Scotland Site Reference NS06SE 3 [1]\nOther sources\nScott, Nicki (2018). Rothesay Castle. Edinburgh: Historic Scotland. ISBN 978-1-84917-138-0.\nExternal links\nWikimedia Commons has media related to Rothesay Castle.\nHistoric Environment Scotland - Rothesay Castle\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1204,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "55.836461",
      "lon": "-5.055041"
    }
  },
  {
    "name": "Skipness Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Skipness_Castle",
    "text": "Skipness Castle stands on the east side of the Kintyre peninsula in Scotland, near the village of Skipness. Together with the nearby Kilbrannan Chapel it is a scheduled ancient monument.[1]\nHistory\nThe main structure of the castle was built in the early 13th century by the Clan MacSween, with later fortifications and other additions made to the castle through the 13th, 14th and 16th centuries.\nView from Skipness Castle\nThe castle was garrisoned with royal troops in 1494, during King James IV of Scotland's suppression of the Isles. James IV appointed Duncan Forestar as keeper of the castle.[2] Archibald Campbell, 2nd Earl of Argyll, granted Skipness to his younger son, Archibald Campbell, in 1511.[3]\nDuring the Wars of the Three Kingdoms in 1646, the castle was besieged by forces under the command of Alasdair Mac Colla. During the siege, Alasdair's brother, Gilleasbuig Mac Colla, was killed in August 1646.[4] The castle was abandoned in the 17th century.\nReferences\nExternal links\nHistoric Environment Scotland. \"Skipness Castle and Kilbrannan Chapel (SM13225)\".\nWikimedia Commons has media related to Skipness Castle.\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "55.7680",
      "lon": "-5.3364"
    }
  },
  {
    "name": "Castle Sween",
    "wikiPage": "https://en.wikipedia.org/wiki/Castle_Sween",
    "text": "11th century castle in Scotland\nCastle Sween, also known as Caisteal Suibhne,[1] and Caistéal Suibhne,[2] is located on the eastern shore of Loch Sween, in Knapdale,[3] south of the forestry village of Achnamara on the west coast of Argyll, Scotland. Castle Sween is thought to be one of the earliest stone castles built in Scotland, having been built in the late 11th century.[4][3] The castle's towers were later additions to wooden structures which have since vanished.[3]\nHistory\nCastle Sween is the oldest stone castle in Scotland, built in the late 11th century by Suibhne, son of Hugh Anrahan, brother of the king of Ulster and High King of Ireland, from whom it takes its name Suibhne.[5]\nAs late as the thirteenth century, the MacSweens possessed the surrounding lands of Knapdale. However, by the second half of the century, these territories passed into the hands of the Stewart/Menteith family.[5]\nIn 1310, Edward II, King of England, granted John MacSween, and his brothers, the MacSweens' ancestral lands of Knapdale, provided that they oust John Menteith. It is possible that MacSween, and his claim to his family's lost Scottish homeland, may be the subject of the Gaelic poem Dál chabhlaigh ar Chaistéal Suibhne. If so, this poem may well refer to an expedition by MacSween to retake Castle Sween in about 1310.[5]\nIn 1323, after the death of John Menteith, the Lordship of Arran and Knapdale passed to his son and grandson. In 1376, half of Knapdale, which included the castle, passed into the possession of John MacDonald I, Lord of the Isles, by a grant from his father-in-law, Robert II, King of Scotland.[5]\nDuring the MacDonalds' century and a half of holding the castle, the castellans were first MacNeils and later MacMillans.[6]\nThe 16th century manuscript known as The Book of the Dean of Lismore includes the lament of Aithbhreac Inghean Coirceadal (f. 1460), which remains a highly important poem in Scottish Gaelic literature. Aithbhreac, after being widowed, composed a lament addressed to the rosary of her late husband, a Tacksman of Clan MacNeil and former constable of Castle Sween.[7]\nIn 1490, Castle Sween was granted to Colin Campbell, 1st Earl of Argyll, by James IV, King of Scotland.[6]\nIn 1647, during the Wars of the Three Kingdoms, Castle Sween was attacked and burnt by Alasdair MacColla and his Irish Confederate followers.[6]\nIn 1933, the castle was put in the care of the Historic Building and Monuments Directorate (HBMD).[8] Currently Castle Sween is under the protection of Historic Scotland.[8]\nConservation\nA 2018 report from Historic Environment Scotland noted that Castle Sween is at \"very high risk\" of coastal erosion due to climate change.[9]\nIn popular culture\nCastle Sween was featured in the 2021 Starz TV series Men in Kilts: A Roadtrip With Sam and Graham (from Outlander) episode 7 \"Clans and Tartans\".[10]\nCitations\nReferences\nArgyll: An Inventory of the Monuments. Vol. 7, Mid Argyll & Cowal. The Royal Commission on the Ancient and Historical Monuments of Scotland. 1992. ISBN 0-11-494094-0 – via ScotlandsPlaces.\nEwart, G; Triscott, J; Holmes, NM McQ; Caldwell, D; Stewart, H; McCormick, F; Holden, T; Mills, C (1997). \"Archaeological excavations at Castle Sween, Knapdale, Argyll & Bute, 1989-90\" (PDF). Proceedings of the Society of Antiquaries of Scotland. 126: 517–557. doi:10.9750/PSAS.126.517.557. eISSN 2056-743X. ISSN 0081-1564. S2CID 222132464 – via Archaeology Data Service.\nRaven, JA (2005). Medieval Landscapes and Lordship in South Uist (PhD thesis). Vol. 1. University of Glasgow – via Glasgow Theses Service.\nExternal links\nWikimedia Commons has media related to Castle Sween.\nCastle Sween Visitor Page – Historic Environment Scotland\nHistoric Environment Scotland. \"Castle Sween (SM90068)\".\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "11th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "55.9479",
      "lon": "-5.6654"
    }
  },
  {
    "name": "Tarbert Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Tarbert_Castle",
    "text": "Tarbert Castle in 2008 before restoration works\nTarbert Castle is located on the southern shore of East Loch Tarbert, at Tarbert, Argyll, Scotland, at the north end of Kintyre. Tarbert Castle was a strategic royal stronghold during the Middle Ages and one of three castles at Tarbert. The castle overlooks the harbour and although pre 14th century in construction, the tower dates back to 1494 and the visit of James IV to the Western Highlands.\nHistory\nIn 712, Tarbert was burned by King Selbach mac Ferchair of Cenél Loairn and of Dál Riata and in 731 by his son, Dúngal mac Selbaig.[1]\nKing Edward II of England handed control of the castle to the Scottish King John II de Balliol in 1292. A fortified structure was built in Tarbert during the 13th century. It was reinforced with the addition of an outer bailey and towers in the 1320s by Robert the Bruce. A tower house was added in the 16th century, which is the most noticeable part of the remains. The castle occupies high land above the village, providing views up Loch Fyne and beyond to the Firth of Clyde. This castle was captured from John MacDonald of Islay, Lord of the Isles by James IV of Scotland as part of his campaign to destroy the power of the Lords of the Isles in 1494. In 1687 the castle was involved in another skirmish when Walter Campbell of Skipness Castle seized it as a stronghold for Archibald Campbell, 9th Earl of Argyll as part of actions in support of the Monmouth Rebellion in England.\nThere are only a couple of standing walls left. The castle has a commanding view of the water approaches.\nNow owned by the community and part of a volunteer-maintained heritage park.[citation needed]\nConstables of Tarbert Castle\nJohn de Lany 1326[2]\nCharles MacAlister 1481\nReferences\nBibliography\nDavid Hicks (1982), The Highland Clans, ISBN 978-0-09-144740-3\nAnnals of Ulster, AD 431-1201 (vols. 1 and 2) edition and translation\nExternal links\nTarbert Royal Castle Archived 3 March 2016 at the Wayback Machine\nTarbert's Royal Castle (official website)\n55°51′49″N 5°24′31″W / 55.86361°N 5.40861°W / 55.86361; -5.40861\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1201,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "55.86361",
      "lon": "-5.40861"
    }
  },
  {
    "name": "Annan Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Annan_Castle",
    "text": "Annan Castle, was a castle that was located on the banks of the River Annan, in Annan, Scotland.[1]\nA motte and bailey castle was built in the early 12th century by the de Brus family, Lords of Annandale. A flood in the mid-12th century changed the course of the River Annan, which caused the castle mound to be partially eroded. The castle was abandoned as the main seat of the de Brus family, who moved to Lochmaben Castle.\nIn February 1552 a master mason David Dog was sent by Regent Arran to hire stonemasons to work \"at the tour of Annand\".[2]\nThe site of the castle is designated a scheduled ancient monument.[3]\nExternal links\nThe Mote of Annan and Annan Castle\nCitations\n54°59′19″N 3°15′51″W / 54.9886°N 3.2643°W / 54.9886; -3.2643\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "12th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "54.9886",
      "lon": "-3.2643"
    }
  },
  {
    "name": "Auchen Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Auchen_Castle",
    "text": "This article is about the Auchen Castle ruins. For the hotel and wedding venue, see Auchen Castle Hotel.\nAuchen Castle is a ruined 13th-century quadrangular castle situated near Moffat, Dumfries and Galloway. It was designated as a scheduled ancient monument in 1937.[1]\nHistory\nThe castle was probably built by the Kirkpatrick family in the early to mid-13th century, possibly to replace the nearby motte-and-bailey castle at Garpol Water and command the valley of the River Annan to the east and the ravine formed by Garpol Burn to the south. The first documentary evidence of the estate is from a charter from December 1306 in which Sir Roger de Kirkpatrick loans money to Sir Humphrey de Bohun, 4th Earl of Hereford. After Kirkpatrick's death during the siege of Lochmaben Castle in 1313, the lands appear to have been transferred to Thomas Randolph, 1st Earl of Moray, although it is unclear what happened to them after his death in 1332. By the 15th century, the castle was owned by the Douglasses of Morton, before later passing to the Johnstones of Corehead, possibly during King James II's campaign against the Douglasses.[1][2]\nIn its earliest form, the castle comprised a four-sided enclosure with the entrance on the north wall. It had a round bastion at the north west angle and a garderobe in the east curtain wall. The walls were protected by a broad ditch, except in the north where a causeway passed over a linked pair of fish ponds. The entrance was later reinforced by a dog-leg forework in the form of a pend. In the late 15th or early- to mid-16th century, the castle was adapted for use as an artillery fortification with the walls lowered and reinforced with masonry and earth.[2]\nAn inventory made of goods belonging to the deceased James Douglas of \"Auchencassill\" in October 1483 includes a folding table, a horse, a chalice and altar ornaments, a sword, a featherbed, bed curtains and canopy, and the hangings or apparelling of the hall, a cushion, a silver salt and spoon, kitchen ware, an eel crook, and other items. This selection was claimed by William Douglas of Drumlanrig as his heir.[3]\nReferences\n^ a b Historic Environment Scotland. \"Auchen Castle (SM683)\". Retrieved 25 February 2019.\n^ a b \"Auchen Castle | Canmore\". canmore.org.uk. Retrieved 22 March 2020.\n^ Acts of the Lords Auditors of Causes and Complaints (Edinburgh, 1839), p. *119.\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": "13th Century",
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "55.31706",
      "lon": "-3.475865"
    }
  },
  {
    "name": "Buittle Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Buittle_Castle",
    "text": "Dervorguilla of Galloway by Wilhelm Sonmans\nRuins of Buittle Castle\nBuittle Castle, also known historically as Botle or Botel Castle, is a Motte and Bailey site in Galloway, south-west Scotland with significant early and medieval history comprising a significant ruined Norman style Motte, and several extant buildings and gardens, including the later residential building in the form of the Tower House, on the historic Bailey. It is located in the valley of the River Urr, 1 kilometre (0.62 mi) west of Dalbeattie. The castle is within the parish of Buittle, in the traditional county of Kirkcudbrightshire and is a scheduled ancient monument.[1][2]\nA motte and bailey castle was built either by Uchtred, Lord of Galloway or his son Roland, Lord of Galloway, in the 12th century. The castle passed by marriage to John de Balliol through the heiress of Alan, Lord of Galloway, Dervorguilla of Galloway, who built the Norman castle. Robert de Brus, 5th Lord of Annandale, captured the castle in 1286. The castle was in English hands in 1296. King Robert the Bruce captured the castle in 1308,[3] and it was given to Sir James Douglas, Lord of Douglas.\nThe castle came into Edward Balliol's hands in 1332, before being given to Archibald the Grim, 3rd Earl of Douglas, in 1372. The castle remained in the hands of the Douglasses until 1456, when the castle reverted to the Crown. The castle was later in the hands of the Maxwells and briefly the Gordons of Lochinvar. The Motte was slighted in 1595, leaving the remaining buildings of the Bailey, which, it is believed, had already been taken on by this time as the primary residential buildings.[4] This residential shift from the motte to the bailey of the castle began, in the first place, with the building of a Mansion House dated to AD 1347,[5] likely affixed to the keep of the bailey, built by Edward Balliol, and latterly by the Tower House as the primary residential building of the castle. By this time in Scottish history, the tower house was the prevailing form of castle, or fortified building in Scotland.[6]\nThe castle was in the ownership of the Maxwells of Buittle by the 16th century,[7] but by the mid 18th century, probably due to a combination of Jacobite associations and changing fashion, the family had moved to Munches House, a Neo-Classical mansion a few miles to the west. It was at this time that the historic Motte and Bailey were put to agricultural use, and subsumed into the larger Munches Estate. Francis Grosse shows the Castle in a roofless state in 1798, with agricultural activities being undertaken in the buildings of the courtyard.[8] The Munches Estate was divided and sold in the mid 20th century, but the ruins of the Motte were separately disponed from the bailey and remained in the possession of the Maxwells of Munches until 1984 when they were gifted to Balliol College, Oxford by Peter Maxwell QC of Munches [1] himself a Balliol man. [2]\nEarly history\nBetween 1993 and 2000 significant archeological excavations were undertaken on the bailey of Buittle Castle, by A. Penman and E Cochrane. From these it has become apparent that the site has been occupied since at least the Mesolithic age, and also was subsequently occupied and, presumably, fortified by the Romans at this strategic point of crossing over the Water of Urr.\nAmongst the finds were a proliferation of Neolithic, Bronze Age and Iron Age artefacts. The digs uncovered evidence of a permanent settlement during the Mesolithic era, temporary settlement during the Neolithic/Early Bronze Age, and permanent Iron Age/Romano-British occupation from the time of Agricola's invasion of Galloway in AD 82–84. An area of prehistoric pasture land has yielded a number of lithics, and there is post-hole and pottery evidence of an early roundhouse on this level.\nNumerous prehistoric lithics and a small quantity of Roman and Romano-British pottery including sherds of amphora, a Romano-Celtic shrine, Romano-British pottery and a Roman bronze cavalry stud were also found.[9]\nMedieval period\nIt appears that sometime around the turn of the 11th century the raised areas of ground were moated and a timber Motte and Bailey fortress was established.[10] This complemented the existing Motte of Urr, further up the river. With the construction of this timber fortification and the large complex of buildings which sprung up around it, we see the proper beginnings of the Castle, which was to later be fortified in stone.[11]\nThe stone fortifications ca. 1200 eventually comprised the residential Motte (some 100 x 150 feet), where the Lords of Galloway had their private chambers as well as the major reception rooms necessary for the running of a semi-sovereign demesne, the Inner Bailey with its two-storey Keep, Chapel of Ease, and associated buildings, and the Outer Bailey, likely comprising workshops and servants dwellings, stabling, etc.[12] These eventually formed the primary seat of the Lords of Galloway, which Lordhip was eventually settled on Devorguilla, as the sole surviving heiress of Alan of Galloway.\nIt is difficult to understate Lady Devorguilla's influence during her lifetime, especially in her Lordship of Galloway which centred around her seat at Buittle. Her marriage to John de Balliol of Barnard Castle was a powerful alliance which only increased her status. In her own right she owned manors from France to Hitchin in Hertfordshire, and the coming together of the two great houses of Galloway and Balliol meant that the pair wielded an enormous amount of power. By all accounts, however, Devorguilla was noted for her piety and she and her husband ruled Galloway benevolently and with an eye to the public good.[13] It was likely under her auspices that the Chapel of Ease, now no longer extant, was built at Buittle, and it must be either this establishment or her promulgation of the Statutes of Balliol College, annotated 'apud Botel', which is connected to the discovery of a Papal Bulla of Honorius IV during the excavations on the bailey.[14]\nAlthough King John did try to rule in the example of his parents, his attempts to summon parliaments, and to put down lawlessness were not enough to stave off accusations of ceding too much power to King Edward of England, to whom he was greatly indebted for support during the Great Cause. When he was forced to rebel against English control of Scotland, his followers were roundly defeated by the English at the Battle of Dunbar (1296) after which he was stripped of the crown of Scotland by Edward I and became a prisoner of the English, never returning to Buittle Castle. The castle eventually fell to Robert the Bruce's forces in February 1313, under the command of his brother Edward Bruce. King Robert retained possession of Buittle until finally granting it to Sir James Douglas, Lord of Douglas. The Douglases retained possession until Edward Balliol, King John's son, was crowned in 1332 in his attempt to overthrow King Robert the Bruce's son, King David II, but his attempt failed miserably.[15] The new Lord of Douglas, Sir William, later Earl of Douglas, recaptured Buittle Castle for King David in 1352 and it once more reverted to the Douglases.[16]\nEdward built a stone and timber-framed Mansion House on the Bailey in preference to the Motte. It is likely at this time that the fortified, or Barmkin, Courtyard would have been established which is today attached to the Tower House, thereby making a more easily defended central nucleus of buildings. If Edward's father could have been said to be a failed King of Scots, he was nothing compared to Edward himself, who ceded the whole of Lothian to Edward III, King of England in thanks for his support in retaking the throne. In 1356, after a series of astonishing setbacks, he surrendered his claim to the Scottish Throne, and died in Doncaster a year later.[17][18]\nIn 1456 Buittle reverted to the Crown, as part of the James, 9th Earl of Douglas's forfeiture. It would seem that, at this time, James III of Scotland settled the Barony of Buittle on his Queen, Margaret of Denmark, as part of her dowry. Some time after, it was granted to the Maxwells, in whose hands it remained for the next 450 years.[19]\nGeorgian to 20th century - farming period\nWilliam, 15th Lord Maxwell, who, after his father's death, was affectionately called the 6th Earl of Nithsdale by the people of Galloway, participated in the Jacobite Rising of 1745, but, apart from suffering the indignities imposed on all Jacobite supporters, seems to have come away from the affair relatively unscathed. Like all Jacobites, he was no longer legally permitted to make repairs to fortified buildings. It is likely that, at this time, he closed the tower of Buittle Castle and unroofed it for tax purposes, putting the courtyard's other buildings to agricultural use. Munches House, a new mansion in the Neo-Classical Robert Adam style, became the seat of the Maxwells of Munches, Terraughty, and Buittle, a subsidiary line of the Lord's of Maxwell. Buittle, therefore, passed through this Maxwell line, but, with the more fashionable house at Munches as the seat of the consolidated estate. It was not until ca. 1820 that Buittle was re-roofed and inhabited by tenant farmers. The most famous of these late 18th-century Maxwells was John Maxwell of Terraughty, born at Buittle, and presumably the last resident of the castle before the move to Munches. He was immortalised in Robert Burns's birthday epistle to him, which begins:\n‘Health to the Maxwell's veteran Chief!\nHealth, aye unsour'd by care or grief:\nInspired I turn'd Fate's sibyl leaf\nThis natal morn;\nI see thy life is stuff o’ prief,\nScarce quite half-worn.’\nIn 1949 Desmond Herries-Maxwell disponed the lands of Buittle to smallholding dairy farmers the Barrowmans. Desmond Maxwell, and latterly his son Peter Maxwell, Lord Maxwell QC however, retained portions of the estate. In 1984 Lord Maxwell bequeathed the ruins of the ancient Motte unto ‘The Master and Scholars of Balliol College’. This historic conveyance marked the 720th anniversary of the founding of Balliol.\nRestoration and present day\nOld Place of Buittle\nThe current buildings, known during the farming period as Old Place of Buittle or Buittle Place [20] comprise the Barmkin Courtyard with its main building - a largely 16th century Tower House, as well as a printing workshop and other outbuildings in the grounds of the bailey. It would seem that the tower house with courtyard complex had become known as Buittle Castle at least until the buildings were given over to agricultural use in the 18th century, as witnessed by Grose, Cardonnel, MacGibbon and Ross, et al.[21][22][23] By about 1790 the tower was roofless but in the mid-nineteenth century it was re-roofed to serve as accommodation for farm workers when it became part of the neighbouring Munches estate, during which time the bartizan angle turrets were removed.[24] The buildings, therefore, provided a challenge for restoration as significant farm buildings and arrangements had been erected during this period, as well as significant historical features removed.\nThe site was sold in 1992 to Jeffrey Burn, an artist, historian and re-enactor, who started the restoration of the historic buildings, largely stripping away the alterations and accretions of the farming period.[25] Burn renamed the buildings 'Old Buittle Tower', seemingly the first time that this name was used in connection to the property. The current owners have reverted to the name used by Grose and Cardonnel of Buittle Castle, reflecting the continued occupation and history of the comprehensive site. This courtyard of the current castle contains the Talla-bìdh Tea Room, the Laigh or Great Hall, and B&B accommodation. In the vaulted undercroft of the tower is a chapel which regularly offers liturgical services according to the medieval Use of Sarum under the auspices of the Autonomous Orthodox Metropolia of North and South America and the British Isles. The grounds contain a variety of garden areas designed and installed to highlight periods in the site's history, including a sunken garden designed on 15th century models by Anne Jennings. The property comprising the bailey of Buittle Castle is now used as a private residence, B&B, and religious site. The ruinous Motte of the Motte and Bailey site remains in the possession of Balliol College, Oxford, and is positioned to the immediate east of the Bailey.\nCitations\nExternal links\nWikimedia Commons has media related to Buittle Place.\nhttp://archives.balliol.ox.ac.uk/History/buittle.asp\nOfficial website\n54°56′07″N 3°50′40″W / 54.9352°N 3.8445°W / 54.9352; -3.8445\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1200,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "54.9352",
      "lon": "-3.8445"
    }
  },
  {
    "name": "Caerlaverock Castle",
    "wikiPage": "https://en.wikipedia.org/wiki/Caerlaverock_Castle",
    "text": "Castle in Dumfries and Galloway, Scotland\nCaerlaverock Castle is a moated triangular castle first built in the 13th century. It is located on the southern coast of Scotland, eleven kilometres (seven miles) south of Dumfries, on the edge of the Caerlaverock National Nature Reserve. Caerlaverock was a stronghold of the Maxwell family from the 13th century until the 17th century, when the castle was abandoned. It was besieged by the English during the Wars of Scottish Independence, and underwent several partial demolitions and reconstructions over the 14th and 15th centuries. In the 17th century, the Maxwells were created Earls of Nithsdale, and built a new lodging within the walls, described as among \"the most ambitious early classical domestic architecture in Scotland\".[1] In 1640 the castle was besieged for the last time by the Protestant Covenanter army and was subsequently abandoned. Although demolished and rebuilt several times, the castle retains the distinctive triangular plan first laid out in the 13th century. Caerlaverock Castle was built to control trade in early times.[2]\nThe castle, which is protected as a scheduled monument, is in the care of Historic Environment Scotland,[3] and is a popular tourist attraction.\nEtymology\nThe name Caerlaverock is of Brittonic origin.[4] The first part of the name is the element cajr meaning \"an enclosed, defensible site\", (Welsh caer meaning \"fort, city\").[4] The second part of the name may be the personal name Lïμarch (Welsh Llywarch),[4] or a lost stream-name formed from the adjective laβar, \"talkative\" (Welsh llafar, see Afon Llafar),[4] suffixed with –ǭg, \"having the quality of\",[4] or the adjectival suffix -īg.[4] The present form has been influenced by the Scots word laverock, \"skylark\".[4]\nHistory\nView of one of the northern towers of the old, early 13th-century castle\nThe present castle was preceded by several fortifications in the area: a Roman fort on Ward Law Hill and a British hill fort that was in use around 950. The chronicles in the 12th-century Annales Cambriæ state that King Gwenddoleu ap Ceidio died nearby at the Battle of Arthuret in 573. His death triggered his bard Myrddin Wyllt to go insane and retreat into the woods, an act that later inspired the character of Merlin in Arthurian legend.[5]\nThe Maxwell family can be traced back to Undwin and his son Maccus in the 11th century; Maccus gave his name to the barony of Maccuswell or Maxwell. His grandson, John de Maccuswell (d. 1241), was first Lord Maxwell of Caerlaverock. The Baronies of Maxwell and Caerlaverock then passed down through the male line, sometimes collaterally. Robert de Maxwell of Maxwell, Caerlaverock and Mearns (d. 1409) rebuilt Caerlaverock castle and was succeeded by Herbert Maxwell of Caerlaverock (d. 1420).\nThe earliest mention of the lands of Caerlaverock is around 1160, when they were granted to the monks of Holm Cultram Abbey.[1] Around 1220 Alexander II of Scotland granted the lands to Sir John Maxwell, making him Warden of the West March. Sir John Maxwell also served as Chamberlain of Scotland from 1231 to 1233,[1] and began work on the first castle at Caerlaverock. This castle was square in shape and was one of the earliest stone castles to be built in Scotland. It had a moat with a bridge facing north. Only the foundations and remains of a wooden enclosure around it remain.[6]\nThis early castle may have been incomplete when it was abandoned in favour of a rock outcrop some 200 metres (660 ft) to the north. It was here that Sir John's brother Sir Aymer Maxwell began construction of the present castle. Sir Aymer also served as Chamberlain in 1258–1260, and was Justiciar of Galloway in 1264.[1] In the 1270s the \"new\" castle was completed, and Herbert Maxwell, nephew of John Maxwell, occupied it.\nHistoric view of Caerlaverock Castle\nWhen the moat around the second castle was dug, the quarrying was probably a source of building stone for the castle.[7] While the gatehouse stands on natural rock, the rest of the castle was built on a clay platform created especially for the castle.[8]\nWars of independence\nIn 1299, the garrison of Caerlaverock attacked Lochmaben Castle which was held by English forces.\nSiege of Caerlaverock\nCaerlaverock Castle by J. M. W. Turner, c.1832\nThe castle from the south-west in 2016\nIn July 1300 King Edward I of England marched north with an army including eighty-seven of the Barons of England and several knights of Brittany and Lorraine, and besieged Caerlaverock. Those present on the English side included Henry de Lacy, Earl of Lincoln; Robert FitzWalter; Humphrey de Bohun, Earl of Hereford; John, Baron Segrave; Guy de Beauchamp, Earl of Warwick; John of Brittany, Earl of Richmond; Patrick, Earl of March and his son; Prince Edward (the future Edward II); Thomas, Earl of Lancaster, and his brother Henry; Richard Fitzalan, Earl of Arundel; and Antony Bek, Bishop of Durham. The Maxwells, under their chief Sir Eustace Maxwell, mounted a vigorous defence of the castle which repelled the English several times. In the end, the garrison was compelled to surrender, after which it was found that only sixty men had withstood the whole English army for a considerable period.\nDuring the siege the English heralds composed a roll of arms in Old French verse, known as the Siege of Caerlaverock, in which each noble or knight present was named, his feats of valour described, and a poetic blazon of his armorial bearings given.[9][10][11][12]\nRecovery\nPossession of the castle was subsequently restored to Sir Eustace Maxwell, Sir Herbert's son, who at first embraced the cause of John Balliol, and in 1312 received from Edward II an allowance of £20 for the more secure keeping of the castle. He afterwards gave in his adherence to Robert Bruce, and his castle, in consequence, underwent a second siege by the English, in which they were unsuccessful. Fearing that this important stronghold might ultimately fall into the hands of the enemy, and enable them to make good their hold on the district, Sir Eustace dismantled the fortress, service and sacrifice for which he was liberally rewarded by Robert Bruce.\nBy 1337 the castle was once again inhabited, and Sir Eustace now changed sides again, giving his support to Edward Balliol. Around 1355 Sir Roger Kirkpatrick of Closeburn captured Caerlaverock for David II of Scotland, and partly dismantled the castle.[13]\nRepair and rebuilding\nView showing the latter addition to the castle at the north end of the Inner Court\nBy the end of the Wars of Independence in the mid-14th century, Caerlaverock had been regained by the Maxwells, with Sir Robert Maxwell rebuilding much of the castle between 1373 and 1410.[13] Further work was undertaken by Robert, 2nd Lord Maxwell, in the mid-15th century, probably involving reconstruction of the gatehouse. A new west range was added within the walls around 1500.[13]\nThe Catholic Maxwells took up the cause of Mary, Queen of Scots, after her forced abdication in 1567. Caerlaverock was besieged in 1570 by an English Protestant force led by the Earl of Sussex, and was again partly demolished, including the destruction of the gatehouse with gunpowder.[13]\nBy 1593, John, 8th Lord Maxwell was repairing the castle again, building up the gatehouse for defence against the Johnstones of Annandale, with whom the Maxwells were feuding.[13] The 8th Lord was killed by the Johnstones during a fight at Dryfe Sands, and in 1613 the 9th Lord Maxwell was executed for the revenge murder of Sir James Johnstone.\nEarls of Nithsdale\nIn 1619 Robert, 10th Lord Maxwell, married Elizabeth Beaumont, cousin of the Duke of Buckingham, a favourite of James VI of Scotland. He was subsequently made Earl of Nithsdale and appointed to the Privy Council of Scotland. To reflect his new status he built the elaborate south and east ranges within the castle, known as the Nithsdale Lodging.[13]\nCaerlaverock Castle in 1900\nThe new ranges were completed around 1634. Nithsdale was at Caerlaverock in August 1637, and wrote to Sir Richard Graham asking for dogs for hunting and breeding.[14] Religious turmoil soon turned against the staunchly Catholic Maxwells. In 1640 the Protestant Covenanter army besieged Caerlaverock for 13 weeks, eventually forcing its surrender. According to Sir Henry Vane, the Earl and Countess of Nithsdale and their page were allowed to leave, but 40 defenders called Maxwell were put to the sword.[15] The south wall and tower were demolished, and the castle was never repaired or reoccupied.[13]\nIn the mid 19th century, the castle was in the possession of William Constable-Maxwell, 10th Lord Herries of Terregles (1804–1876), heir of the 5th Earl of Nithsdale.[16]\nArchitectural description\nThe castle ground floor plan from MacGibbon and Ross, showing the ranges of the building.\nThe castle is most unusual in having a triangular form, one of only a small number across Europe and the only one in the UK. [17] As well, it is unusual for Scotland in having a moat and earthwork ramparts around it. It sits in a low lying formerly swampy area on the flood plain of the nearby River Nith, again unusual for a defensive structure in this area of Scotland. It is however, the finest example of a castle in south-west Scotland. [18]\nThe basic form is triangular, with the Gatehouse to the north formed of two large drum towers (see plan). In the south west and south east corners there are further but smaller drum towers. Murdoch’s Tower to the south west is largely complete, but the tower to the south east was reduced to base level during the Covenanter siege of 1640.\nDespite many sieges and slightings followed by rebuildings, the original form of the castle can still be appreciated, the curtain wall bases largely remaining at lower levels, these dating to the original construction in the last quarter of the thirteenth century (HES Statement of Significance op cit, p10) The early parts of the castle were built of red sandstone quarried at nearly Bankend. [19] While of later build, to the west and east much of the curtain walls stand to parapet height.\nWithin the courtyard formed by the curtain walls there are four ranges: the Gatehouse, the west range, the Banqueting Hall range and the Nithsdale Lodging range (see plan), a small triangular courtyard being formed between them. [20] These ranges are of different dates. Especially to the south, the buildings are ruinous, the Banqueting Hall range in particular being reduced for the most part to no more than a few metres high.\nA. The Gatehouse range is the earliest remaining part of the castle. It consists of the two massive drum towers faced in ashlar with the entrance passage between the towers. The west tower is largely original, but the east tower was largely rebuilt in the late fifteenth century. While ruinous at the upper levels, the drum towers still stand above the drawbridge to a height of some 15.5 metres to the machicolations, these dating to the late fifteenth century rebuild. Internally, the gatehouse has an entrance with portcullis and above a hall, later subdivided (Stell op cit, p112).\nB. The west range dates to around 1500 and while roofless is largely complete. The range consists essentially of a series of rectangular rooms on two floors, each with a fireplace, the rooms most likely used as accommodation (Stell op cit, p112.)\nC. The south or Banqueting House range was reduced to walls of only a few metres high or less, largely as a result of the Covenanter's siege in 1640, when artillery fire and then slighting reduced the walls (and at the same time the SE tower). The Hall was of substantial size, and some evidence of its former grandeur can be gauged from the remains of the large fireplace on the north wall.\nD. Sitting to the north east of the interior, and the last part of the castle to be built, the Nithsdale Lodging building is the most complete part of the castle. Although lacking its two eastern most bays it is perhaps the most spectacular part of the castle, with its magnificent Renaissance façade of the 1630s (SoS op cit, 12-13). The remaining front is decorated with a series of carved pediments over nine large windows, three smaller ones and two doorways, depicting various armorials and symbolic sculptures (SoS op cit, 16-18) . Internally, the rooms are quite small, due to the placement of a fireplace/flue block in the centre of the structure. With the kitchens and other service rooms on the ground floor, the rooms on the first and higher floors were most likely used as private apartments.\nNature reserve\nCaerlaverock Castle is within the Nith Estuary National Scenic Area, protected for its scenic qualities, with the castle recognised as a landmark of the area.[21] The castle is at the northern edge of the Caerlaverock National Nature Reserve, which extends to 55 square kilometres (21 sq mi) and consists of saltmarsh, mudflats and grazing land. It is an internationally important wintering site for waterfowl and wading birds, including the barnacle goose.[22]\nCultural references\nThe castle was used as a location for the 2011 romantic comedy film The Decoy Bride.[23]\nReferences\nBibliography\nBrault, Gerard J., ed. (1973). \"Siege of Caerlaverock\". Eight Thirteenth-Century Rolls of Arms in French and Anglo-Norman Blazon. University Park, Pa.: Pennsylvania State University Press. pp. 102–125. ISBN 0271011157.\nGifford, John (1996). Dumfries and Galloway. Pevsner Architectural Guides: The Buildings of Scotland. Yale. ISBN 0-300-09671-2.\nNicolas, Nicholas Harris, ed. (1828). The Siege of Caerlaverock in the XXVIII Edward I. A.D. MCCC; with the Arms of the Earls, Barons, and Knights, who were present on the occasion; with a Translation, a History of the Castle, and Memoirs of the Personages Commemorated by the Poet. London: J. B. Nichols and Son.\nO'Neil, B. H. St. J. (1967). Caerlaverock Castle: Official Guide. HMSO.\nWilson, David M.; Hurst, John G. (1957). \"Medieval Britain in 1956\" (PDF). Medieval Archaeology. 1. doi:10.5284/1000320.[permanent dead link‍]\nWilson, David M.; Hurst, John G. (1959). \"Medieval Britain in 1958\" (PDF). Medieval Archaeology. 3. doi:10.5284/1000320.[permanent dead link‍]\nWright, Thomas, ed. (1864). The Roll of Arms of the Princes, Barons, and Knights who attended King Edward I. to the Siege of Caerlaverock, in 1300; edited from the manuscript in the British Museum, with a translation and notes. London: John Camden Hotten.\nExternal links\nWikimedia Commons has media related to Caerlaverock Castle.\nHistoric Environment Scotland: Visitor guide\n\"Caerlaverock\". Castles in Scotland. Retrieved 5 July 2015.\n\"Caerlaverock Castle\". About Scotland. Retrieved 5 July 2015.\n\"Caerlaverock Castle\". Clan Maxwell Society of the USA. Archived from the original on 24 February 2015. Retrieved 5 July 2015.\n<img src=\"https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?useformat=desktop&amp;type=1x1&amp;usesul3=0\" alt=\"\" width=\"1\" height=\"1\" style=\"border: none; position: absolute;\">",
    "earliestDate": {
      "earliest": 1160,
      "pre1291Found": true,
      "post1291Found": true
    },
    "coordinates": {
      "lat": "54.9756408",
      "lon": "-3.5239534"
    }
  }
]